{"meta":{"title":"Software Power","subtitle":"The power of Software!","description":"A portfolio legend!","author":"Ahmadreza Vakilalroayayi","url":"http://yoursite.com"},"pages":[{"title":"All categories","date":"2019-08-10T00:54:16.000Z","updated":"2022-12-25T15:15:21.673Z","comments":true,"path":"categories/index.html","permalink":"http://yoursite.com/categories/index.html","excerpt":"","text":""},{"title":"Our latest web sites","date":"2019-06-05T14:59:18.073Z","updated":"2019-06-05T14:59:00.000Z","comments":true,"path":"files/old-posts/our-latest-web-sites-deprecated.html","permalink":"http://yoursite.com/files/old-posts/our-latest-web-sites-deprecated.html","excerpt":"","text":"Work examplesIt’s time to show you a collection. This collection is a set of most beautiful websites that we have created. In these websites we have mostly used, Java, JavaScript, Spring Boot, PHP, MySql and MongoDB. There are also Rest API and server side programmings. All of our customers are happy from our services and our products. We are still giving them support and still helping them in their marketing. We will talk about the back-end in other post, so let’s check some outcome now. Wedding shopThis website sell products that is related to ceremonies. FoodThis website has lot to say in food productions. FoodThis website also related to food productions. Ocean blogA modified design of a Node.js blog engine. We use technologies such as Hexo. Plants and flowersWe have lots of customers in this area. We help in implementations, supports and bug fixings. Plants and flowersOne of our skills is designing logos which we are expert at. We are full stack developers, we can do anything, when we say anything, we mean it! WallpaperLook at this masterpiece. A website that work on interior design and ceremonies. Pink WeddingThis website is also related to weddings and ceremonies. CateringFood catering. Flower CityA website that sells flowers and plants. Flower and plantsThis website also sells flowers and plants. If you are interested in any of the above themes and&#x2F;or designs please let us know when you are ordering from us."},{"title":"Do you need a website?","date":"2019-08-09T14:55:00.812Z","updated":"2019-08-09T14:55:00.830Z","comments":true,"path":"files/old-posts/the-best-weblog.html","permalink":"http://yoursite.com/files/old-posts/the-best-weblog.html","excerpt":"","text":"Do you want the best website&#x2F;weblog with content management system? WITH FREE HOSTING Do you need a website to spread your news about anything? We work internationally and we give services to any location that you are. We sell weblog and websites such as this website with the best price and&#x2F;or payment plans. We offer you the best services and also the best quality of support. All of our products comes with deployment, installations and also user manual. You can choose your domain name (Website URL&#x2F;Address) and we check if your desired name is taken by someone yet or not.You can of course search your desired name on GoDaddy. So these are the costs: The address to your website. The service that we give you. Including 247 support, installation and remote lesson to teach you how to work with your website and how to add new contents. You will also get: A free unique logo. Free web hosting. Your unique email address, for example &#x79;&#x6f;&#117;&#114;&#110;&#x61;&#x6d;&#101;&#x40;&#x79;&#x6f;&#117;&#114;&#99;&#111;&#109;&#x70;&#110;&#x61;&#121;&#x6e;&#x61;&#x6d;&#x65;&#x2e;&#99;&#x6f;&#x6d; PriceFrom 70$ or 700SEK Payment PlanFrom 7$ or 70SEK monthly Welcome to contact us!"},{"title":"Do you want more audience?","date":"2019-04-09T14:55:00.812Z","updated":"2019-04-09T14:55:00.812Z","comments":true,"path":"files/old-posts/track-your-visitors-with-us.html","permalink":"http://yoursite.com/files/old-posts/track-your-visitors-with-us.html","excerpt":"","text":"Do you want to manage your visitors? We can help you to know more about your audience and your visitors to your websites. Their city, their country, the time of their visits, your unique visitors and much more… We can also help you increase your audience and have full control on your website traffic. What you will get from us: Countries that you want to block Your web pages that you want or you don’t want to be searched by search engines. Total visitors of today, yesterday, last week, last year, etc. View visitors by their genders, age, etc. View your visitors by their country or their city. Be on top in Google search when someone search for products&#x2F;articles that you have And much more as you wish… Welcome to contact us!"}],"posts":[{"title":"What are relational databases?","slug":"whats-relational-db","date":"2021-04-11T07:52:32.000Z","updated":"2021-04-11T07:52:32.000Z","comments":true,"path":"2021/04/11/whats-relational-db/","link":"","permalink":"http://yoursite.com/2021/04/11/whats-relational-db/","excerpt":"","text":"Relational databases explained Relational databases are a type of database management system that are based on the relational model. They are designed to store data in a structured manner, using tables with rows and columns to represent different types of data. Relational databases are widely used in modern software development, providing a powerful tool for storing, managing, and querying data. In this article, we will explore the key features and benefits of relational databases, including how they work, their components, and their importance in modern software development. How Relational Databases Work Relational databases work by storing data in tables, with each table representing a different type of data. Each table consists of rows and columns, with each row representing a specific instance of the data, and each column representing a specific attribute or characteristic of the data. For example, a table representing customers might have columns for the customer’s name, address, phone number, and email address, with each row representing a specific customer. This makes it easy to organize and manage data, and to retrieve specific pieces of data as needed. Relational databases use a structured query language (SQL) to interact with the data stored in the tables. SQL allows developers to retrieve, insert, update, and delete data, and to perform complex queries that combine data from multiple tables. Components of Relational Databases Relational databases consist of several components, including: Tables: Tables are the basic building blocks of a relational database, representing different types of data. Rows: Rows represent specific instances of the data stored in the tables. Columns: Columns represent the attributes or characteristics of the data stored in the tables. Relationships: Relationships are used to link data stored in different tables, allowing developers to retrieve and combine data from multiple tables. Benefits of Relational Databases Relational databases provide a range of benefits for modern software development, including: Data Integrity: Relational databases enforce rules and constraints that ensure data is stored accurately and consistently. This reduces the risk of errors and inconsistencies in the data. Scalability: Relational databases are highly scalable, allowing them to handle large volumes of data and complex queries. Security: Relational databases provide a range of security features, such as encryption and access controls, to protect data and prevent unauthorized access. Flexibility: Relational databases are highly flexible, allowing developers to easily modify and extend the database schema as needed. Conclusion In conclusion, relational databases are a powerful tool for storing, managing, and querying data in modern software development. By using tables with rows and columns to represent different types of data, relational databases provide a structured and organized way to manage data, making it easy to retrieve and combine data as needed. As software development continues to evolve, relational databases are likely to remain a critical component of modern software systems, providing a flexible and scalable way to manage data in a wide range of applications.","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"What is Prototyping?","slug":"whats-prototype","date":"2021-03-09T04:49:22.000Z","updated":"2021-03-09T04:49:22.000Z","comments":true,"path":"2021/03/09/whats-prototype/","link":"","permalink":"http://yoursite.com/2021/03/09/whats-prototype/","excerpt":"","text":"Prototyping explained Prototyping is a technique used in product development to create a preliminary version of a product or system. Prototyping allows designers and developers to test and refine their ideas before finalizing the product, ensuring that it meets the needs of the user and the goals of the project. In this article, we will explore the key features and benefits of prototyping, including how it works, its components, and its importance in modern product development. How Prototyping Works Prototyping works by creating a preliminary version of a product or system, typically using low-fidelity or high-fidelity mockups. Low-fidelity mockups might include sketches or wireframes, while high-fidelity mockups might include interactive prototypes or 3D models. Once the prototype has been created, it is tested and refined to ensure that it meets the needs of the user and the goals of the project. Feedback from users and stakeholders is used to improve the design and functionality of the prototype, with changes being made as needed to ensure that the final product is as effective and efficient as possible. Components of Prototyping Prototyping consists of several components, including: Design: Design is the process of creating a preliminary version of the product or system. This might include sketches, wireframes, or 3D models, depending on the complexity and requirements of the project. Testing: Testing is the process of evaluating the prototype to ensure that it meets the needs of the user and the goals of the project. Feedback from users and stakeholders is used to refine the design and functionality of the prototype. Refinement: Refinement is the process of making changes to the prototype to improve its effectiveness and efficiency. Changes might include modifications to the design, functionality, or user interface, based on feedback from testing and evaluation. Benefits of Prototyping Prototyping provides a range of benefits for modern product development, including: Improved Design: Prototyping allows designers to test and refine their ideas before finalizing the product, resulting in a design that is more effective and efficient. Reduced Risk: Prototyping reduces the risk of errors and delays in product development, as potential issues can be identified and resolved early in the process. Increased User Satisfaction: Prototyping allows designers to test the product with users, ensuring that it meets their needs and preferences. Cost Savings: Prototyping can save time and money by identifying potential issues early in the development process, reducing the need for costly revisions later on. Conclusion In conclusion, prototyping is a powerful tool for modern product development, providing a way to create a preliminary version of a product or system and test it with users and stakeholders. By using prototyping techniques, designers and developers can refine their ideas and create products that are more effective, efficient, and satisfying for users. As product development continues to evolve, prototyping is likely to remain a critical component of modern design processes, providing a flexible and effective way to create innovative and effective products.","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"Big Query","slug":"whats-bigquery","date":"2021-02-04T03:39:11.000Z","updated":"2021-02-04T03:39:11.000Z","comments":true,"path":"2021/02/04/whats-bigquery/","link":"","permalink":"http://yoursite.com/2021/02/04/whats-bigquery/","excerpt":"","text":"What is Google Cloud Big Query? google cloud big queryGoogle Cloud BigQuery is a powerful data analytics tool that allows users to store, process, and analyze large datasets in the cloud. Developed by Google, BigQuery provides a range of features and tools for simplifying the analysis of complex data, making it a popular choice for businesses and organizations of all sizes. In this article, we will explore the key features and benefits of Google Cloud BigQuery, including how it works, its components, and its importance in modern data analytics. How Google Cloud BigQuery Works Google Cloud BigQuery works by providing a scalable and flexible cloud-based data warehouse, which allows users to store and analyze large datasets in a highly efficient and cost-effective manner. BigQuery uses a distributed computing architecture, which allows it to process large volumes of data quickly and efficiently. BigQuery is designed to be highly scalable, allowing users to store and analyze petabytes of data without the need for complex infrastructure or expensive hardware. Additionally, BigQuery is highly flexible, allowing users to analyze data in a range of formats and from a variety of sources, including CSV, JSON, and Avro. Components of Google Cloud BigQuery Google Cloud BigQuery consists of several components, including: Cloud Storage: Cloud Storage is used to store and manage data in the cloud, providing a scalable and flexible way to store and access data. BigQuery API: The BigQuery API is used to interact with data stored in BigQuery, allowing users to query and analyze data in a range of formats and from a variety of sources. BigQuery Web UI: The BigQuery Web UI provides a user-friendly interface for analyzing data in BigQuery, allowing users to run queries, visualize data, and perform other data analysis tasks. Benefits of Google Cloud BigQuery Google Cloud BigQuery provides a range of benefits for modern data analytics, including: Scalability: BigQuery is highly scalable, allowing users to store and analyze petabytes of data without the need for complex infrastructure or expensive hardware. Flexibility: BigQuery is highly flexible, allowing users to analyze data in a range of formats and from a variety of sources. Cost-Effective: BigQuery is a cost-effective way to store and analyze large datasets, with pay-as-you-go pricing and no upfront costs. Performance: BigQuery is designed to be highly performant, allowing users to process and analyze large volumes of data quickly and efficiently. Conclusion In conclusion, Google Cloud BigQuery is a powerful data analytics tool that provides a range of features and tools for storing, processing, and analyzing large datasets in the cloud. By providing a scalable and flexible way to analyze data, BigQuery allows businesses and organizations to gain valuable insights and make informed decisions based on data-driven insights. As data analytics continues to evolve, BigQuery is likely to remain a critical component of modern data analytics, providing a powerful tool for businesses and organizations of all sizes.","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"Big Data Explained","slug":"whats-bigdata","date":"2021-01-16T06:42:14.000Z","updated":"2021-01-16T06:42:14.000Z","comments":true,"path":"2021/01/16/whats-bigdata/","link":"","permalink":"http://yoursite.com/2021/01/16/whats-bigdata/","excerpt":"","text":"What is BIG DATA? big dataBig data refers to the large and complex datasets that are generated by organizations and individuals every day. With the increasing use of digital technologies, big data has become a critical component of modern business and scientific research, providing valuable insights into customer behavior, market trends, and other important metrics. In this article, we will explore the key features and benefits of big data, including how it works, its components, and its importance in modern business and scientific research. How Big Data Works Big data works by collecting and analyzing large volumes of data from a variety of sources, including social media, mobile devices, and other digital platforms. This data is then processed using a range of techniques, including machine learning, data mining, and predictive analytics, to identify patterns and trends that can be used to make informed decisions. Big data is typically characterized by its volume, velocity, and variety. The volume refers to the large volumes of data that are generated, while velocity refers to the speed at which the data is generated and processed. Variety refers to the wide range of different data types that are collected and analyzed, including structured, semi-structured, and unstructured data. Components of Big Data Big data consists of several components, including: Data Sources: Data sources refer to the various sources of data that are used to create big data, including social media, mobile devices, and other digital platforms. Data Processing: Data processing refers to the techniques and tools that are used to process and analyze large volumes of data, including machine learning, data mining, and predictive analytics. Data Storage: Data storage refers to the various storage systems that are used to store and manage big data, including cloud-based storage systems, data warehouses, and Hadoop-based systems. Benefits of Big Data Big data provides a range of benefits for modern business and scientific research, including: Better Insights: Big data allows organizations to gain valuable insights into customer behavior, market trends, and other important metrics, which can be used to make informed decisions. Improved Efficiency: Big data can be used to automate and streamline business processes, improving efficiency and reducing costs. Better Targeting: Big data allows organizations to target their marketing and advertising campaigns more effectively, resulting in higher conversion rates and better ROI. Improved Scientific Research: Big data can be used in scientific research to identify patterns and trends in large datasets, providing valuable insights into complex systems and processes. Conclusion In conclusion, big data is a critical component of modern business and scientific research, providing a powerful tool for collecting, processing, and analyzing large volumes of data. By using big data techniques and tools, organizations and researchers can gain valuable insights into customer behavior, market trends, and other important metrics, improving efficiency, and driving innovation. As data analytics continues to evolve, big data is likely to remain a critical component of modern business and scientific research, providing a powerful tool for organizations and researchers of all sizes.","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"Data Science Explained","slug":"whats-datascience","date":"2021-01-11T05:41:15.000Z","updated":"2021-01-11T05:41:15.000Z","comments":true,"path":"2021/01/11/whats-datascience/","link":"","permalink":"http://yoursite.com/2021/01/11/whats-datascience/","excerpt":"","text":"What is Data Science? Data science is a rapidly growing field that combines statistical analysis, machine learning, and computer science to extract insights and knowledge from data. Data science has become a critical component of modern business and scientific research, providing valuable insights into customer behavior, market trends, and other important metrics. In this article, we will explore the key features and benefits of data science, including how it works, its components, and its importance in modern business and scientific research. How Data Science Works Data science works by collecting, processing, and analyzing data using a range of techniques and tools, including statistical analysis, machine learning, and computer science. Data scientists use these techniques and tools to identify patterns and trends in data, which can be used to make informed decisions and drive innovation. Data science typically involves several stages, including data cleaning and preparation, data analysis and modeling, and data visualization and communication. These stages are designed to ensure that the data is accurate, relevant, and understandable, and that insights gained from the data can be effectively communicated to stakeholders. Components of Data Science Data science consists of several components, including: Data Collection: Data collection involves gathering and storing data from a range of sources, including social media, mobile devices, and other digital platforms. Data Preparation: Data preparation involves cleaning, organizing, and transforming the data to ensure that it is accurate, relevant, and ready for analysis. Data Analysis: Data analysis involves using statistical analysis, machine learning, and other techniques to identify patterns and trends in the data. Data Visualization: Data visualization involves using charts, graphs, and other visual representations to communicate insights gained from the data to stakeholders. Benefits of Data Science Data science provides a range of benefits for modern business and scientific research, including: Better Insights: Data science allows organizations to gain valuable insights into customer behavior, market trends, and other important metrics, which can be used to make informed decisions. Improved Efficiency: Data science can be used to automate and streamline business processes, improving efficiency and reducing costs. Better Targeting: Data science allows organizations to target their marketing and advertising campaigns more effectively, resulting in higher conversion rates and better ROI. Improved Scientific Research: Data science can be used in scientific research to identify patterns and trends in large datasets, providing valuable insights into complex systems and processes. Conclusion In conclusion, data science is a critical component of modern business and scientific research, providing a powerful tool for collecting, processing, and analyzing large volumes of data. By using data science techniques and tools, organizations and researchers can gain valuable insights into customer behavior, market trends, and other important metrics, improving efficiency, and driving innovation. As data analytics continues to evolve, data science is likely to remain a critical component of modern business and scientific research, providing a powerful tool for organizations and researchers of all sizes.","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"Steps to understand a simple blockchain","slug":"whats-blockchain","date":"2020-12-15T04:42:16.000Z","updated":"2020-12-15T04:42:16.000Z","comments":true,"path":"2020/12/15/whats-blockchain/","link":"","permalink":"http://yoursite.com/2020/12/15/whats-blockchain/","excerpt":"","text":"A simple explanation of blockchain A blockchain is a decentralized, immutable, and transparent digital ledger that allows secure transactions between parties without the need for a central authority. The concept of blockchain has gained popularity in recent years due to its potential to revolutionize industries like finance, healthcare, and logistics. In this article, we will explore how to create a simple blockchain using Python. Step 1: Setting Up the Environment To create a blockchain, we first need to set up the environment. We will be using Python 3 and the Flask framework for creating a web application. Step 2: Creating a Block A block is a fundamental component of a blockchain that contains data and a unique hash. In Python, we can create a block as a class with the following attributes: Index: A unique identifier for the blockTimestamp: The time when the block was createdData: The data stored in the blockHash: The unique hash of the blockStep 3: Creating a Genesis Block A genesis block is the first block in the blockchain. It is created manually and does not contain any previous block information. The genesis block is necessary to initialize the blockchain. We can create a genesis block by initializing the first block with an index of 0, a timestamp of the current time, an empty data field, and a hash value of 0. Step 4: Creating a Blockchain A blockchain is a collection of blocks that are linked together using hashes. To create a blockchain, we need to create a class that contains a list of blocks and methods to add blocks and check the integrity of the chain. The blockchain class should also have a method to generate a hash for each block in the chain. Step 5: Mining Blocks Mining is the process of adding a new block to the blockchain. To mine a block, we need to create a new block with data and add it to the blockchain. We also need to calculate the hash of the previous block and set it as the previous hash for the new block. Step 6: Validating the Blockchain To ensure the integrity of the blockchain, we need to validate each block in the chain. We can do this by checking the hash of each block against the hash of the previous block. If the hash does not match, it means that the block has been tampered with and the blockchain is no longer valid. Now to make this happen we can to the following: Step 1: Import necessary librariesIn Python, you can use hashlib to generate hash values and Flask to create a web application. Step 2: Create a Block classDefine a Block class with the following attributes: index: unique identifier for the blocktimestamp: the time when the block was createddata: the data stored in the blockprevious_hash: the hash of the previous blockAlso, define a method to calculate the hash value of the block using the hashlib library. Step 3: Create a Genesis blockCreate the first block in the blockchain, also known as the Genesis block. It has a unique index, timestamp, an empty data field, and a hash value of zero. Step 4: Create a Blockchain classDefine a Blockchain class that has the following attributes: chain: a list of blocks in the blockchaincurrent_data: data stored in the current blocknodes: a set of nodes in the blockchain networkAlso, define the following methods: add_block(): add a new block to the blockchainvalidate_chain(): validate the integrity of the blockchain by checking the hash values of each blockStep 5: Run the Flask applicationCreate a Flask web application that allows users to interact with the blockchain. Users can add data to the current block and mine the block to add it to the blockchain. Conclusion:Creating a simple blockchain using Python is a great way to understand the basics of blockchain technology. By building on this basic blockchain, developers can create more complex blockchain applications that have the potential to revolutionize industries and transform the way we do business.","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"What is CORS (Cross Origin Resource Sharing)","slug":"whats-cors","date":"2020-11-15T15:16:11.000Z","updated":"2020-11-15T15:16:11.000Z","comments":true,"path":"2020/11/15/whats-cors/","link":"","permalink":"http://yoursite.com/2020/11/15/whats-cors/","excerpt":"","text":"What is Cross Origin Resource Sharing CORS is a security feature implemented in web browsers that allows web applications to make requests to resources on a different domain than the one hosting the web page. It is designed to prevent unauthorized access to resources on different domains, which can be a security risk. Before CORS, web applications were limited to accessing resources only from the same domain, which could limit their functionality and reduce their usefulness. CORS provides a way for web applications to safely request resources from a different domain, while preventing unauthorized access to those resources. How does CORS work? When a web application makes a request to a different domain, the browser sends a preflight request to the server to check if the server allows cross-origin requests. The preflight request includes information about the request, such as the HTTP method, headers, and content type. The server responds to the preflight request with the Access-Control-Allow-Origin header, which specifies which domains are allowed to make cross-origin requests. The server can also specify which HTTP methods, headers, and content types are allowed in cross-origin requests. If the response from the server is successful, the browser sends the actual request to the server, including any data or parameters required for the request. Why is CORS important for web security? CORS is an important security feature because it prevents malicious scripts from accessing sensitive information on different domains. Without CORS, an attacker could use a cross-site scripting (XSS) attack to inject malicious code into a web page and then access sensitive information from a different domain. CORS also prevents cross-site request forgery (CSRF) attacks, which occur when an attacker tricks a user into unknowingly making a request to a different domain. By preventing unauthorized requests to different domains, CORS helps to ensure the security and integrity of web applications. Conclusion In conclusion, CORS is a security feature that allows web applications to safely request resources from a different domain, while preventing unauthorized access to those resources. It is an important security feature that helps to ensure the security and integrity of web applications. By implementing CORS, developers can create more functional and secure web applications that can access resources from different domains.","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"An At-Home Study on Heart Health And AFib Detection","slug":"pandemic-at-hom-study-hearth-health","date":"2020-10-11T10:02:24.000Z","updated":"2020-10-11T10:02:24.000Z","comments":true,"path":"2020/10/11/pandemic-at-hom-study-hearth-health/","link":"","permalink":"http://yoursite.com/2020/10/11/pandemic-at-hom-study-hearth-health/","excerpt":"","text":"An At-Home Study on Heart Health And AFib Detection While the world is slowly opening back up after being shut down for months, if you or someone you love is 65 and older, home is where you are still likely spending most your time. And while at home, you can consider participating in the Heartline Study sponsored by the Janssen Pharmaceutical Companies of Johnson & Johnson in collaboration with Apple. Since the study is completely virtual, there’s no travel necessary to doctors’ offices or anywhere else. “People can participate from the safety of their home,” says Paul Burton, M.D, Chief Global Medical Affairs Officer at Janssen Scientific Affairs. “They’ll be able to participate in a heart health engagement program with activities that may help improve sleep, fitness and wellness, while contributing to innovative heart health research.” The study seeks to find whether the Heartline Study app, and heart health features on the Apple Watch, can improve clinical outcomes, including reducing the risk of stroke from earlier detection of atrial fibrillation (AFib). The Heartline Study also has articles and facts to keep you engaged in your heart health. AFib is a common form of irregular heart rhythm that the Centers for Disease Control and Prevention estimates is responsible for 158,000 deaths and 454,000 hospitalizations annually in the U.S. It also accounts for more than one-third of all strokes. However, as Dr. Burton notes, “it can be difficult to diagnose since people often do not experience symptoms.” Here are some tips that can help you take control of your heart health even while adhering to the stay-at-home order: • Engage in short bouts of physical activity. AFib incidence increases with age – about 70 percent of AFib patients are between 68 and 85 – and even the slightest activity can improve everything from energy to focus to overall health. One starting point: pacing while doing those virtual chats. • Eat heart-healthy food. “Fruits, vegetables, and fish or chicken are obvious places to begin,” Johns Hopkins Medicine advises. • Manage high blood pressure. It’s one of the top risk factors for AFib. Readings above 140 for systolic pressure or above 90 for diastolic pressure are considered high. Who is eligible for the Heartline study? Those who are 65 or older, have Original (Traditional) Medicare and own an iPhone 6s or later model. Individuals with or without a diagnosis of AFib may qualify. Other eligibility criteria apply. There are a variety of ways to participate in the Heartline Study. You will need to have an iPhone 6s or newer. Some participants will take part using only their iPhone. Some participants will also be asked to wear an Apple Watch. Those asked to wear a watch will be offered two options: purchase one, or get one on loan for the duration of the study and return it when your participation in the study ends. Johnson & Johnson and Apple are committed to ensuring that participation in the study is not limited based on financial need. To learn more, and to download the Heartline Study app, visit Heartline.com. Tweet","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"Build your own botnet","slug":"build-your-own-botnet","date":"2020-10-10T14:21:29.000Z","updated":"2020-10-10T14:21:29.000Z","comments":true,"path":"2020/10/10/build-your-own-botnet/","link":"","permalink":"http://yoursite.com/2020/10/10/build-your-own-botnet/","excerpt":"","text":"Build your own botnet Image by TheAndrasBarta from Pixabay What is a botnet? A botnet is a number of Internet-connected devices, each of which is running one or more bots. Botnets can be used to perform Distributed Denial-of-Service attacks, steal data, send spam, and allows the attacker to access the device and its connection in order to perform something such as mining bitcoin as an example. This article is only for educational purpose and we are not responsible for any malicious behaviour. How to own a botnet? You can own a bot net if you have multiple devices across the globe waiting for your command. You can only perform commands on those machine if you have enough privileges and to have these privileges you have to infect the target machine with malware so it perform your command. So let's own a bot net! For this example we use a post-exploitation framework. This framework called BYOB (Build Your Own Botnet) and here is a brief instruction on how to get started with it. Questions? Join the Discord server Disclaimer: This project should be used for authorized testing or educational purposes only. BYOB is an open-source post-exploitation framework for students, researchers and developers. It includes features such as: Pre-built C2 server Custom payload generator 12 post-exploitation modules It is designed to allow students and developers to easily implement their own code and add cool newfeatures without having to write a C2 server or Remote Administration Tool from scratch. This project has 2 main parts: the original console-based application (/byob) and the web GUI (/web-gui). Web GUIDashboardA control panel for your C2 server with a point-and-click interface for executing post-exploitation modules. The control panel includes an interactive map of client machines and a dashboard which allows efficient, intuitive administration of client machines. Payload GeneratorThe payload generator uses black magic involving Docker containers &amp; Wine servers to compile executable payloads for any platform&#x2F;architecture you select. These payloads spawn reverse TCP shells with communication over the network encrypted via AES-256 after generating a secure symmetric key using the Diffie-Hellman IKE. Terminal EmulatorThe web app includes an in-browser terminal emulator so you can still have direct shell access even when using the web GUI. Console ApplicationClient Generate fully-undetectable clients with staged payloads, remote imports, and unlimited post-exploitation modules Remote Imports: remotely import third-party packages from the server without writing themto the disk or downloading&#x2F;installing them Nothing Written To The Disk: clients never write anything to the disk - not even temporary files (zero IOsystem calls are made) because remote imports allow arbitrary code to bedynamically loaded into memory and directly imported into the currently runningprocess Zero Dependencies (Not Even Python Itself): client runs with just the python standard library, remotely imports any non-standardpackages&#x2F;modules from the server, and can be compiled with a standalone pythoninterpreter into a portable binary executable formatted for any platform&#x2F;architecture,allowing it to run on anything, even when Python itself is missing on the target host Add New Features With Just 1 Click: any python script, module, or package you copy to the ./byob/modules/ directoryautomatically becomes remotely importable &amp; directly usable by every client whileyour command &amp; control server is running Write Your Own Modules: a basic module template is provided in ./byob/modules/ directory to make writingyour own modules a straight-forward, hassle-free process Run Unlimited Modules Without Bloating File Size: use remote imports to add unlimited features without adding a single byte to theclient’s file size Fully Updatable: each client will periodically check the server for new content available forremote import, and will dynamically update its in-memory resourcesif anything has been added&#x2F;removed Platform Independent: everything is written in Python (a platform-agnostic language) and the clientsgenerated can optionally be compiled into a portable executable (Windows) orbundled into a standalone application (macOS) Bypass Firewalls: clients connect to the command &amp; control server via reverse TCP connections, whichwill bypass most firewalls because the default filter configurations primarilyblock incoming connections Counter-Measure Against Antivirus: avoids being analyzed by antivirus by blocking processes with names of known antivirusproducts from spawning Encrypt Payloads To Prevent Analysis: the main client payload is encrypted with a random 256-bit key which exists solelyin the payload stager which is generated along with it Prevent Reverse-Engineering: by default, clients will abort execution if a virtual machine or sandbox is detected Modules Post-exploitation modules that are remotely importable by clients Persistence (byob.modules.persistence): establish persistence on the host machine using 5 different methods Packet Sniffer (byob.modules.packetsniffer): run a packet sniffer on the host network &amp; upload .pcap file Escalate Privileges (byob.modules.escalate): attempt UAC bypass to gain unauthorized administrator privileges Port Scanner (byob.modules.portscanner): scan the local network for other online devices &amp; open ports Keylogger (byob.modules.keylogger): logs the user’s keystrokes &amp; the window name entered Screenshot (byob.modules.screenshot): take a screenshot of current user’s desktop Webcam (byob.modules.webcam): view a live stream or capture image&#x2F;video from the webcam Outlook (byob.modules.outlook): read&#x2F;search&#x2F;upload emails from the local Outlook client Process Control (byob.modules.process): list&#x2F;search&#x2F;kill&#x2F;monitor currently running processes on the host iCloud (byob.modules.icloud): check for logged in iCloud account on macOS Miner (byob.core.miner): mine Monero in the background using the built-in miner or XMRig Server Command &amp; control server with persistent database and console Console-Based User-Interface: streamlined console interface for controlling client host machines remotely viareverse TCP shells which provide direct terminal access to the client host machines Persistent SQLite Database: lightweight database that stores identifying information about client host machines,allowing reverse TCP shell sessions to persist through disconnections of arbitraryduration and enabling long-term reconnaissance Client-Server Architecture: all python packages&#x2F;modules installed locally are automatically made available for clientsto remotely import without writing them to the disk of the target machines, allowing clients to use modules which requirepackages not installed on the target machines Core Core framework modules used by the generator and the server Utilities (byob.core.util): miscellaneous utility functions that are used by many modules Security (byob.core.security): Diffie-Hellman IKE &amp; 3 encryption modes (AES-256-OCB, AES-256-CBC, XOR-128) Loaders (byob.core.loaders): remotely import any package&#x2F;module&#x2F;scripts from the server Payloads (byob.core.payloads): reverse TCP shell designed to remotely import dependencies, packages &amp; modules Stagers (byob.core.stagers): generate unique payload stagers to prevent analysis &amp; detection Generators (byob.core.generators): functions which all dynamically generate code for the client generator Database (byob.core.database): handles interaction between command &amp; control server and the SQLite database Handler (byob.core.handler): HTTP POST request handler for remote file uploads to the server Credits Clone this project from byob on Github Open the project","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"BBQSQL - A Blind SQL Injection Exploitation Tool","slug":"kali-bbqsql","date":"2020-10-09T20:30:00.000Z","updated":"2022-12-25T15:15:21.664Z","comments":true,"path":"2020/10/10/kali-bbqsql/","link":"","permalink":"http://yoursite.com/2020/10/10/kali-bbqsql/","excerpt":"","text":"Vulnerability Analysis - BBQSQL Package Description Blind SQL injection can be a pain to exploit. When the available tools work they work well, but when they don’t you have to write something custom. This is time-consuming and tedious. BBQSQL can help you address those issues. BBQSQL is a blind SQL injection framework written in Python. It is extremely useful when attacking tricky SQL injection vulnerabilities. BBQSQL is also a semi-automatic tool, allowing quite a bit of customization for those hard to trigger SQL injection findings. The tool is built to be database agnostic and is extremely versatile. It also has an intuitive UI to make setting up attacks much easier. Python gevent is also implemented, making BBQSQL extremely fast. Similar to other SQL injection tools you provide certain request information. Must provide the usual information: URL HTTP Method Headers Cookies Encoding methods Redirect behavior Files HTTP Auth Proxies Then specify where the injection is going and what syntax we are injecting. Source: https://github.com/Neohapsis/bbqsql/ BBQSQL Homepage | Kali BBQSQL Repo Author: BBQSQL License: BSD Kali Source: See on Kali Tools Documentation","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"An example of a dictionary for brute force attacks","slug":"bruteforce-dictionary-example","date":"2020-09-11T05:45:45.000Z","updated":"2020-09-11T05:45:45.000Z","comments":true,"path":"2020/09/11/bruteforce-dictionary-example/","link":"","permalink":"http://yoursite.com/2020/09/11/bruteforce-dictionary-example/","excerpt":"","text":"Are you really safe? How strong are your passwords? It is easy to guess a password if you rather to choose a simple password that anyone can remember. Most people use a password that they can remember such as date of a birthday, pet name, wife name, car model and so on. In this article I have provided you a file that called dictionary which most of the attackers used to crack login pages, social media accounts, WIFI attack, etc. In this file you can see how simple are most passwords and that is why we must always use combination of upper and lower case letters together with numbers and special characters. The file is a large so make sure you open it with Vim, Emacs or Notepad++. Note that this is only one example of a list, there are tons of lists out there which you can find them easily after some searches. You can download the file here Download","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"Covid Pandemic Highlights Value of Transportation Techs","slug":"covid-pandemic-highlights-value-of-transportation-techs","date":"2020-08-25T13:51:08.000Z","updated":"2020-08-25T13:51:08.000Z","comments":true,"path":"2020/08/25/covid-pandemic-highlights-value-of-transportation-techs/","link":"","permalink":"http://yoursite.com/2020/08/25/covid-pandemic-highlights-value-of-transportation-techs/","excerpt":"","text":"Covid Pandemic Highlights Value of Transportation Techs (NewsUSA) The Covid-19 pandemic has driven education for children of all ages from school to home, and often a hybrid of both. As remote learning stretches into the new school year in many areas, parents are worried, with parents of young children especially concerned about writing. More than half of parents of young children (54 percent) say that \"writing is the area of greatest concern,\" in terms of remote learning, according to a survey conducted by Learning Without Tears (LWT), a company that has been providing writing and other educational materials to parents and teachers for more than 40 years. Parents faced with remote learning want to know how to develop and improve their children’s handwriting without the guidance of a teacher in a classroom setting. \"Whether you are employed outside the home, or a stay-at-home parent, remote learning is challenging. Some subjects, like handwriting, are particularly difficult without a teacher’s direct instruction, which creates a lot of angst at home,\" says Lana Dugdale, from Southborough, MA, mother of three young kids, including a rising first-grader.LWT is meeting the home-based learning challenges with improved and innovative updates to its classic and proven products. \"It’s clear now that too many students were left behind as the country moved to distance learning,\" says Terry Nealon, CEO of Learning Without Tears.\"During a child’s elementary years, any gap in learning can result in setbacks that impact that student for the rest of his/her life. Learning Without Tears has always focused on improving learning outcomes; we don’t have to accept those gaps.\"To enhance remote learning, families can choose from a range both digital and print resources: activity books geared towards various elementary school grades, including books on letters and numbers, printing, and cursive, as well as keyboarding programs. In addition, with sharing materials out and hand sanitizer in, individual manipulative packs for hands-on learning are the ideal solution for single student use in the classroom, or for parents opting for homeschooling in small groups or pods. Need more handwriting resources? There’s an app for that. Designed to help young children learn the correct way to form letters and numbers and to show parents how to support that learning, LWT has launched \"Wet, Dry, Try,\" for use on an iPad. With over four hours of instruction and technology that identifies individual student needs, the app provides a multisensory approach, with customized audio instructions that give teachers a way to monitor student progress remotely, when they can’t be in school.Learning loss during school shutdown has parents, teachers, and kids worried, stressed, and looking for solutions, and LWT resources are improving this unsettled situation. So teachers can be as effective remotely as they are in the classroom, LWT’s +Live Insights – its platform that brings all of its solutions together for in-school, at-home, and hybrid teaching – facilitates crucial data-driven individualized student instruction, as well as \"whole class\" gallery approach that was typical of remote teaching in the spring.The only thing certain about back-to-school this year, is its uncertainty. Visit LWTears.com for more information about early education products and resources for families and teachers to weather the new world of remote learning and beyond. Tweet","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"Hidden Eye a social engineering tool","slug":"hidden-eye","date":"2020-08-03T09:38:04.000Z","updated":"2020-08-03T09:38:04.000Z","comments":true,"path":"2020/08/03/hidden-eye/","link":"","permalink":"http://yoursite.com/2020/08/03/hidden-eye/","excerpt":"","text":"A Modern Phishing Tool With Advanced Functionality TO BE USED FOR EDUCATIONAL PURPOSES ONLY What is social engineering? In the context of information security, social engineering is the psychological manipulation of people into performing actions or divulging confidential information. This differs from social engineering within the social sciences, which does not concern the divulging of confidential information. What is Phishing? Phishing is the fraudulent attempt to obtain sensitive information or data, such as usernames, passwords and credit card details, by disguising oneself as a trustworthy entity in an electronic communication. Experiment and demonstration of such attack Follow these instructions to boost your experience on how a Phishing tool called HiddenEye works. DISCLAIMERThe use of the HiddenEye &amp; its resources&#x2F;phishing-pages is COMPLETE RESPONSIBILITY of the END-USER. Developers assume NO liability and are NOT responsible for any misuse or damage caused by this program. Also we inform you that some of your your actions may be ILLEGAL and you CAN NOT use this software to test person or company without WRITTEN PERMISSION from them. AVAILABLE TUNNELLING OPTIONS LOCALHOST LOCALXPOSE (https://localxpose.io) SERVEO (https://serveo.net/) NGROK (https://ngrok.com/) LOCALTUNNEL (Package Version) (https://localtunnel.me) OPENPORT (https://openport.io/) PAGEKITE (https://pagekite.net/) TESTED ON FOLLOWING: Kali Linux - Rolling Edition Parrot OS - Rolling Edition Linux Mint - 18.3 Sylvia Ubuntu - 16.04.3 LTS MacOS High Sierra Arch Linux Manjaro XFCE Edition 17.1.12 Black Arch Userland App (For Android Users) Termux App (For Android Users) PREREQUISITES Python 3.* PHP sudo pyngrok WHAT’S NEW FEATURES1) LIVE ATTACK Now you will have live information about the victims such as : IP ADDRESS,Geolocation, ISP, Country, &amp; many more. 2) COMPATIBILITY All the sites are mobile compatible. 3) KEYLOGGER Now you will also have the ability to capture all the keystokes of victim. You can now Deploy Keyloggers With (Y&#x2F;N) option. Major issues fixed. 4) ANDROID SUPPORT We care about Android Users, So now we have came with two ways to runHiddenEye in Android Devices. (A) UserLand App You Have to Download UserLand App.Click Here ToDownload it. To read more how to set up userland app ReadHERE (B) Termux App You Have to Download Termux App.Click Here ToDownload it. For Further instructionCheck Instructions Termux Users Clone With This Command , Unless Errors may occur during Running. 12git clone -b Termux-Support-Branch https://github.com/DarkSecDevelopers/HiddenEye.git 5) NEW LOOK PROVIDED NOW FOCUS EASILY ON TASKS… CUSTOMIZE APP WITH YOUR OWN THEMES 6) SERVEO URL TYPE SELECTION AVAILABLE NOW Major issues with serveo is fixed. Now You can choose out of CUSTOM URL and RANDOM URL. 7) LARGE COLLECTION OF PHISHING PAGES ADDED Pages are taken from various tool including ShellPhish , Blackeye , SocialFish. 8) CAPTURED DATA BACKUP Backup of Data can be Found At (Server&#x2F;CapturedData). 9) EMAIL SUPPORT ADDED Captured Data can be Easily send to Any Email Address (Using Gmail SMTP). It Require User’s Gmail Username And Password. GMAIL 2FA SHOULD BE DISABLED IN ORDER TO USE GMAIL SMTP. LESS SECURED APPS SHOULD BE TURNED ON(https://myaccount.google.com/lesssecureapps). 10) CUSTOM TEMPLATES ADDED Two Extra Custom Templates Added. Now Create Your Templates. Check Instructions At ( Webpages&#x2F;CUSTOM&#x2F;manual.txt ) 11) TOOLS ADDED A) LOCATION (Accurately Locate Smartphones using Social Engineering) (ThanksTo https://github.com/thewhiteh4t/seeker) NEAR YOU (By @thewhiteh4t ) GDRIVE (By @thewhiteh4t) Installation instructionsBlackArch official repository1sudo pacman -S hidden-eye to run just use 1sudo hiddeneye Clone the project1git clone https://github.com/DarkSecDevelopers/HiddenEye.git Running on Linux1234567chmod 777 HiddenEyesudo apt install python3-pipcd HiddenEyesudo pip3 install -r requirements.txtsudo pip3 install requestssudo pip3 install pyngrokpython3 HiddenEye.py Running on Arch Linux or Manjaro1234567chmod 777 HiddenEyesudo pacman -Syusudo pacman -S python-pip,cd HiddenEyesudo pip3 install -r requirements.txtsudo pip3 install pyngroksudo python3 HiddenEye.py Installation on Android1) Installation on Userland AppInstall userland app from playstore. Set up app and install Kali from the app. Set ssh username (anyname) and password. When Kali runs it will asks for password, type the ssh password. After that Kali will run on your device without root and run apt updateFor more info read here (https://null-byte.wonderhowto.com/how-to/android-for-hackers-turn-android-phone-into-hacking-device-without-root-0189649/) 123456sudo apt install python3 python3-pip unzip php gitgit clone https://github.com/DarkSecDevelopers/HiddenEye.gitchmod 777 HiddenEyecd HiddenEyepip3 install -r requirements.txt &amp;&amp; pip3 install requestspython3 HiddenEye.py 2) Installation on Termux appFirst install Termux from Playstore. After installation of Termux run the following commands one by one: 12345678pkg install git python php curl openssh grepgit clone -b Termux-Support-Branch https://github.com/DarkSecDevelopers/HiddenEye.gitchmod 777 HiddenEyepip install requirements.txtpip install requestscd HiddenEyepython HiddenEye.py Or run this single command: 12pkg install git python php curl openssh grep &amp;&amp; git clone -b Termux-Support-Branch https://github.com/DarkSecDevelopers/HiddenEye.git &amp;&amp; chmod 777 HiddenEye &amp;&amp; cd HiddenEye &amp;&amp; pip install -r requirements.txt &amp;&amp; pip install requests &amp;&amp; python HiddenEye.py Ascii error fix dpkg-reconfigure locales Then select: “All locales” Then select “en_US.UTF-8” After that reboot your machine. Then open terminal and run the command:&quot;locale&quot; There you will see “en_US.UTF-8” which is the default language. Instead of POSIX. Credits Read more about HiddenEy on Github Open the project","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"Twitter reacted to the social engineering hacking","slug":"twitter-respond-on-hack","date":"2020-07-25T07:36:35.000Z","updated":"2020-07-25T07:36:35.000Z","comments":true,"path":"2020/07/25/twitter-respond-on-hack/","link":"","permalink":"http://yoursite.com/2020/07/25/twitter-respond-on-hack/","excerpt":"","text":"The first reaction to the hacking of Twitter accounts of celebrities The first reaction to the hacking of Twitter accounts of celebrities such as Barack Obama, Bill Gates, Elon Musk, etc., Twitter announced that hackers had been able to carry out this attack by targeting some employees with access to internal systems and sensitive information. In response to this unprecedented attack on his Twitter account says: We noticed that a social engineering attack on some of our employees who had authorized access to internal systems and sensitive data. Our research is still ongoing and that’s what we know so far. Attackers targeted the accounts of celebrities, politicians and some companies, they sent messages to victims asking them to transfer thousands of dollars in BTC to their account.","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"Three Ways to Stay Connected to Your Senior Loved Ones While Social Distancing","slug":"three-ways-to-stay-connected-to-your-senior-loved-ones-while-social-distancing","date":"2020-05-07T10:56:07.000Z","updated":"2020-05-07T10:56:07.000Z","comments":true,"path":"2020/05/07/three-ways-to-stay-connected-to-your-senior-loved-ones-while-social-distancing/","link":"","permalink":"http://yoursite.com/2020/05/07/three-ways-to-stay-connected-to-your-senior-loved-ones-while-social-distancing/","excerpt":"","text":"Three Ways to Stay Connected to Your Senior Loved Ones While Social Distancing After more than 45 days in lockdown, it’s no surprise that many people are going a tad stir-crazy. But it’s far worse for seniors: Not only have visits from their kids and grandkids been suspended, but there’s the extra stress that comes with the nagging suspicion that they’ll be advised to remain on lockdown long after younger people begin trickling back to work and the world starts opening up again. In fact, the AARP Foundation has even come up with this dire comparison: Prolonged social isolation, for those aged 50 and older, “is the health equivalent of smoking 15 cigarettes a day.” Fortuitously, some of the niftiest technology offers solutions both to keep us connected and protect against some of the miscreants taking advantage of the situation. • Health Checks. If you are worried that all of the anxiety is harming your loved ones’ overall well-being, the machine-learning algorithms that analyze activity data as part of Alarm.com’s Wellness solution can provide you with the very details you’ve suddenly found yourself obsessing about. Did they open their medicine cabinet when they should, to take their prescription? Have their sleeping, eating, and (yes) bathroom patterns changed? Are they up and about during the day? All that and more is done by connecting their home to yours via smart-home technology, with real-time smartphone alerts to let you know if something’s amiss. “You don’t even know it’s there, but it’s here to protect you and let someone know if something does go wrong,” says Margarete Pullen of Dallas, Texas, whose son had the system installed by an authorized service provider for her and her husband along with a Wellcam video camera with two-way voice capability. • Movie meet-ups. Most of us are just trying to find novel ways to cope with a situation that Nicholas Christakis, a social scientist and physician at Yale University, told Science magazine “calls on us to suppress our profoundly human and evolutionary hard-wired impulses for connection.” Google’s new Netflix Party extension lets friends and family watch – and video-chat their way through – a movie together on their computers. You’ll need a NetFlix subscription, but then you’re free to debate if the Tiger King is worth all the hype and whether Carol Baskin really did kill her husband. Plus, unlike in real theaters, not many people (if any) are physically there to complain if you’re making too much noise eating popcorn. • Apps! Apps! Apps! No NetFlix subscription? With apps such as FaceTime, Skype, Houseparty and Zoom comes more proof that social distancing needn’t mean social disconnecting. Mass virtual dinner parties. Mass virtual “happy hours.” Mass virtual gym classes. They’ve all become quite the rage, with one Vermont couple in their eighties even touchingly using Apple’s FaceTime to see and talk to each other after the husband had to be put in a nursing home that bars visitors during the pandemic. Want to be a hero in your neighborhood? Use an app such as Instagram to share a video of someone Alarm.com’s doorbell cameras caught swiping one of the many, many packages you’ve been having delivered. Tweet","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"Useful Kali Linux basic commands","slug":"useful-kali-linux-basic-commands","date":"2020-04-02T07:54:18.000Z","updated":"2020-04-02T07:54:18.000Z","comments":true,"path":"2020/04/02/useful-kali-linux-basic-commands/","link":"","permalink":"http://yoursite.com/2020/04/02/useful-kali-linux-basic-commands/","excerpt":"","text":"Useful Kali Linux basic commands In this article I will share some basic and useful commands that you can use in the terminal. freeProvides information about available RAM and total available and available physical space and buffer exchange memory used by Kernal. 1root@kali:~# free vi Editor which used to edit the file. 1root@kali:~# vi [file-to-open-editor] sort Arranges the contents of a text file line by line. 1234root@kali:~# cat a.txt b.txt c.txt | sorta.txtb.txtc.txt more One screen at a time is used to display the output in the terminal. 1root@kali:~# more a.txt less Used to view the file instead of opening the file. It does not open the entire file at once. Used for big files. 1root@kali:~# less huge.txt date This command is used to display the system date and time. 1root@kali:~# date To change the date 1root@kali:~# date --set=’4 Jan 2019 11:20′ cal Shows the formatted calendar from the current month. 1root@kali:~# cal whoami Prints the active ID of the user. Also, who command prints the information about the user that is currently logged in. 1234root@kali:~# whoamirootroot@kali:~# whoroot :1 2019-01-04 11:20 (:1) pwd Abbreviation for “Print Working Directory”, which prints the name of the directory in operation. 123456root@kali:~# pwd/rootroot@kali:~# cd /root/Desktop/myApp/root@kali:~/Desktop/myApp# pwd/root/Desktop/myApproot@kali:~/Desktop/myApp# ls This command is used to show all files. 12root@kali:~# lsa.txt b.txt c.txt worksplace users Displays the login names of recently logged in users. 12root@kali:~# usersroot uptime Indicates when the system is on and active users. 12root@kali:~# uptime15:17:10 up 20 min, 1 user, load average: 0.11, 0.19, 0.20 uname Prints information about the current system. 1root@kali:~# uname Also, use –help to read more about this command. 1root@kali:~# uname --help rm rm(remove) is used to delete files and directories. 123456root@kali:~# rm # Delete files.root@kali:~# rm -f # Delete read only files.root@kali:~# rm -r # Delete the folders.root@kali:~# rm - rf * # Delete everything in current folder.root@kali:~# rm - rf . # Delete current folder with its subfolders.root@kali:~# rm - rf / # Delete everything in root. mv This command moves or renames files and directories in the file system. 1root@kali:~# mv [options] source dest Move a.txt b.txt to &#x2F;home&#x2F;usr&#x2F;myFiles&#x2F; 1root@kali:~# mv a.txt b.txt /home/usr/myFiles/ history This command is used to print the current user bash history. 1root@kali:~# history Or you can save the history in txt file for example: 1root@kali:~# history &gt; myHistory.txt myHistory.txt will be created. cat cat is a standard Unix utility that reads files sequentially, writing them to standard output. The name is derived from its function to concatenate files. 1234root@kali:~# echo &quot;I am learning Linux commands&quot; &gt; sample.txtroot@kali:~# cat sample.txtI am learning Linux commandsroot@kali:~# mkdir Used to create directories. 1root@kali:~# mkdir [your-new-directory-name] cd Used to change or switch a currently working . 1root@kali:~# cd [your-directory-name] cpUsed to copy. 1234root@kali:~# cp sample.txt /root/Desktop/sample.txtroot@kali:~# ls /root/Desktop/sample.txtroot@kali:~#","categories":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}],"tags":[],"keywords":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}]},{"title":"VR Camera Creates Immersive Experience","slug":"vr-camera-creates-immersive-experience","date":"2019-12-28T08:40:09.000Z","updated":"2019-12-28T08:40:09.000Z","comments":true,"path":"2019/12/28/vr-camera-creates-immersive-experience/","link":"","permalink":"http://yoursite.com/2019/12/28/vr-camera-creates-immersive-experience/","excerpt":"","text":"VR Camera Creates Immersive Experience Have you ever thought about what it might be like to relive the best moments of your life, and be able to share them with others? Maybe it’s the dance floor at your wedding. Or the birth of your child or his or her first birthday. Maybe it’s that touchdown that led your team to victory in the last seconds of a game. With today’s mobile virtual reality technology, it’s possible to create virtual memories and it has never been easier to get started. Humaneyes Technologies, an innovator in camera technology, has developed a user-friendly, dual camera that combines 360-degree photography with immersive 3-D Virtual Reality (VR), all in one simple-to-use solution that costs about the same as a decent DSLRcamera. “360-degree pictures and video continue to change how we use cameras to capture the world around us,” says media expert Jim Malcolm of Humaneyes Technologies. “And the global adoption of VR headsets, combined with 3-D cameras, is providing even more ways to create virtual content and virtual memories.” “We’ve done it with the best, from documenting Mako sharks with The Discovery Channel to weightless experiences in the International Space Station, floating more than 250 miles above the horizon.” “We’re now excited to watch, firsthand, as consumers create their own immersive personal stories,” says Malcolm. The Vuze XR flips easily from a 360-degree camera to a VR180 camera and shoots both virtual video and photos. Whether you’re recording or live streaming, users can create and share virtual experiences at that moment, and then save them to revisit next week or next decade. Special features of the VUZE include 18-Mega Pixel still images, built-in stabilization, filters, and a VR editing suite. Plus, it doesn’t get more portable. “Everything can be viewed, controlled and edited, right from your phone, so that you can shoot, create and share virtual videos at a moment’s notice,” says Malcolm. But not everything needs to be virtual; the VUZE also functions as a 5.7K and 4K up to 60fps 2D camera for capturing high-resolution video and pictures to fill out your photo album. Think ahead to the holidays and how the latest in VR technology can help make unforgettable memories and connect far-flung family and friends. The VUZE XR camera also features live streaming and social sharing for platforms, including Facebook and YouTube, so that you can bring your social media audience into the scene with you.","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"What sort of programming language is utilized in Rocket and Rocket direction frameworks?","slug":"rockets-programming-language","date":"2019-11-26T06:41:19.000Z","updated":"2019-11-26T06:41:19.000Z","comments":true,"path":"2019/11/26/rockets-programming-language/","link":"","permalink":"http://yoursite.com/2019/11/26/rockets-programming-language/","excerpt":"","text":"What sort of programming language is used in Rockets? Rockets are developed with C&#x2F;C++ programming language or Ada. This speaks to a significant improvement over past examination because of the item arranged structure, speed, and simplicity of troubleshooting that C&#x2F;C++ offers. It is very important for rocket launchers and space crafts to use the highest security techniques since a vulnerability can cause an unauthorized attacker take control of the missile to use it for malicious ways.","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"Retailers Embrace AI Tech for Improved Customer Experience","slug":"retailers-embrace-ai-tech","date":"2019-09-07T02:49:35.000Z","updated":"2019-09-07T02:49:35.000Z","comments":true,"path":"2019/09/07/retailers-embrace-ai-tech/","link":"","permalink":"http://yoursite.com/2019/09/07/retailers-embrace-ai-tech/","excerpt":"","text":"Retailers Embrace AI Tech for Improved Customer Experience (NewsUSA) – Artificial Intelligence is becoming commonplace across major industries and retail is no exception.The retail industry is looking for ways to keep up with the times and many companies have started implementing AI technology across the entire product and service cycle – from assembly to post-sale customer service interactions.Major retailers such as Walmart, Sephora, Walgreens, North Face, Uniqlo, West Elm, and Macy’s are using AI to enhance customers’ experiences at their stores while also improving security. AI Applications in Retail While hardware giant Lowe’s uses small robots to give directions and help customers navigate a large hardware store, Walgreens is using technology to track the spread of flu, based on the locations of customers picking up prescriptions so they can alert customers to the flu activity in their area and stock more flu-related products.Another example is makeup company Sephora, which now uses AI technology in many of its stores to scan customers’ faces and help them choose the perfect shade of blush, lipstick, or eyeliner without having to test multiple products.Meanwhile, a Walmart store in New York is becoming the “store of the future” by incorporating the latest AI technology. The store’s smart cameras will have the capability to alert workers when items are out of stock and even let them know when a bunch of bananas has gone bad. Providing a Customizable Retail Experience Artificial intelligence is being used for everything from preparing packages in warehouses to enhancing security to creating a customized experience for consumers.One company that is delivering solutions to retail and security is VSBLTY Groupe Technologies Corp. (CSE:VSBY) (OTC:VSBGF). VSBLTY is at the forefront of making AI work in the retail space, developing innovative facial recognition software and interactive digital screens that will provide retailers with a multitude of AI features.VSBLTY’s VisionCaptor content management system brings interactive messages to any digital screen and provides insights on customer demographics and emotional states, allowing engagement with consumers in real time.By commanding guests’ attention with dynamic digital displays, custom content can be provided based on what the display camera “sees,” while gaining valuable insights in real time. Through engaging digital assets such as animations, photos, videos, and multimedia content, VSBLTY software creates a complete customer experience through digital displays, which can be utilized in transit hubs, entertainment and sports venues, grocery stores, drug stores and, really, any retail environments.What’s more, VSBLTY’s VisionCaptor can be integrated with other technologies, including RSS feeds, QR codes, and Bluetooth.”Using Edge- and&#x2F;or Cloud-enabled digital display solutions, retailers can now enhance guest experience with proximity-aware, interactive brand messaging triggered by demographic, identity or even sentiment, while simultaneously gaining groundbreaking levels of measurement and actionable insights,” according to the company’s website. Offering Enhanced Security Features VSBLTY has also developed AI solutions that enhance security.VSBLTY Vector is focused on security solutions that combine video screens with facial recognition software and criminal databases in order to identify “persons of interest” or individuals carrying weapons. Cameras are embedded in screens and can identify individuals alone or in crowds more effectively than overhead cameras, and can allow for demographic and emotional recognition as well as facial and object recognition.By teaching computers how to skillfully interpret their surroundings, VSBLTY software can contextualize all of the information about those surroundings and deliver it to the end-user vetted and streamlined for the particular security application.VSBLTY is publicly traded on the Canadian Securities Exchange, OTC, and Frankfurt, with the symbols CSE:VSBY, OTC:VSBGF, and Frankfurt: 5VS.","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"Spring Boot API","slug":"api","date":"2019-08-08T08:18:00.000Z","updated":"2019-08-08T08:18:00.000Z","comments":true,"path":"2019/08/08/api/","link":"","permalink":"http://yoursite.com/2019/08/08/api/","excerpt":"","text":"What is an API? In computer programming, an application programming interface is a set of subroutine definitions, communication protocols, and tools for building software. In general terms, it is a set of clearly defined methods of communication among various components. Here is a complete example of developing an API with Spring Boot. You can also get the source code. Spring Boot REST APIThis project is a book store API that can be used as a backend for e-commerce. Getting StartedThese instructions will get you a copy of the project up and running on your local machine for development and testing purposes. Make sure you have Apache Maven installed and you have JDK ready for the compilation purposes, you will also need a REST client application such as Postman or Advanced REST client. Clone the repository to your local machine and navigate to the root directory of the project. Run the following command in the root directory in order to package the application and to create Jar files. 123mvn -f server-pom.xml cleanmvn -f server-pom.xml package mvn -f commandline-pom.xml package Now you will have two Jar files in the target directory which one of them belongs to the server and the other one belongs to the commandline application. In order to run both Jar files, navigate to target directory and run the following commands in two separate terminal, shell or Git Bash.Consider that the target directory will be created when you use package command for a pom and will be deleted with clean command. 1java -jar server-1.0-RELEASE.jar 1java -jar commandline-1.0-RELEASE.jar Now you have both the server and the commandline up and running. You will also have a database file called BookShop.db which store all the data. Do you have compilation problem?In case if you had compilation error please add the following plugin in both commandline-pom and server-pom and redo all the above commands again to run the application. 12345678&lt;plugin&gt; &lt;artifactId&gt;maven-compiler-plugin&lt;/artifactId&gt; &lt;version&gt;3.1&lt;/version&gt; &lt;configuration&gt; &lt;fork&gt;true&lt;/fork&gt; &lt;executable&gt;PATH_TO_YOUR_JDK\\bin\\javac.exe&lt;/executable&gt; &lt;/configuration&gt;&lt;/plugin&gt; Important PrerequisitesNow you have the application ready to work, but inorder to work with the application you need to have “user account” to buy books and manage baskets and also an “admin account” to manage the shop. No worries!You can create accounts with both the command line and also through the POST&#x2F;GET request which is discussed further. CommandlineUse the command line tool to have full control on the shop as a customer&#x2F;user or as an admin to manage the shop. Here is how the commandline is look like. 12345678Please choose one of the following options: 1- Login with userId and manage shopping baskets. 2- Login with admin privilege and manage the shop. 3- Create user account. 4- Create admin account. 5- ExitEnter your option: Before you begin using the commandline, make sure that you have created at least a user account and later on to see all users, see all orders and to add new book to the stock, create an admin account. POST&#x2F;GETAlmost all the POST and GET request comes with a respond, message and boolean values which will also help the Front-end developer in the development process. We have two controller, one belongs to the shopping basket and the other one belongs to the store. In order to simplify the use cases, when you run the application for the first time a default user account, admin account and also books will be added to the store. These defaults data are: Default userId: Dummy_User Default username for admin: Dummy_Admin and the password: Dummy Default books are hosting from my server in this address: https://www.softwarepower.ir/other/bookstoredata.txt The server will running on http://localhost:8080/, so the POST and GET requests for the shopping basket are as follows: Start by adding a book to the Dummy_User basket.You can only add books that are already available in the stock, the quantity should be also less or equal to the the available quantity of the shop.If there are no books available in the stock, rerun the application to reload the stock as default or add book through admin account. Shopping BasketTo add (POST) book to the shopping basket of a user:12345678&#123;&quot;title&quot;: &quot;Mastering åäö&quot;,&quot;author&quot;: &quot;Average Swede&quot;,&quot;price&quot;: 762,&quot;quantity&quot;: 2,&quot;description&quot;: &quot;Dummy description&quot;,&quot;bookId&quot;: 0&#125; Note that the quantity here means the quantity that we want to add to the basket.So, post the above JSON object to the following address: http://localhost:8080/addBookToBasket/userId=Dummy_User To GET all books in the basket use the following address and use GET request:http://localhost:8080/showBooksInUserBasket/userId=Dummy_User To GET the price of the basket use the following address and use GET request:http://localhost:8080/totalPriceOfTheBasket/userId=Dummy_User To Delete a specific book from the basket use the following address and POST the book that is already exist in the basket:12345678&#123;&quot;title&quot;: &quot;Mastering åäö&quot;,&quot;author&quot;: &quot;Average Swede&quot;,&quot;price&quot;: 762,&quot;quantity&quot;: 1,&quot;description&quot;: &quot;Dummy description&quot;,&quot;bookId&quot;: 0&#125; Note that the quantity here is the quantity that we want to delete from the basket. POST the above JSON object to the following address to delete the book from the basket: http://localhost:8080/deleteFromBasket/userId=Dummy_User To Delete all books from the basket send a POST request to the following address:http://localhost:8080/deleteAllBooksFromBasket/userId={userId} To Search for a book in the stock, use the following link and replace the searchString with your preferred phrase:http://localhost:8080/search={searchString} To Get book quantity from the stock, use the following link and POST the book details to get the quantity as a respond:http://localhost:8080/getBookQuantity 12345&#123;&quot;title&quot;: &quot;Mastering åäö&quot;,&quot;author&quot;: &quot;Average Swede&quot;,&quot;price&quot;: 762&#125; It is enough to just send the title, author and price since these values will specify a unique book. To Buy all books from the basket, use the following address and with a POST request:http://localhost:8080/buyBooks/userId=Dummy_User Book StoreTo Get all the books from the stock, use the following link with a GET request:http://localhost:8080/bookStock To Get orders list use the following address with a GET request:http://localhost:8080/bookStock/showOrders To Get all admins use the following address with a GET request:http://localhost:8080/bookStock/showAdmins To Get all users use the following address with a GET request:http://localhost:8080/bookStock/showUsers To Check if admin exist use the following address with a GET requesthttp://localhost:8080/bookStock/isAdminExist/adminUserName=Dummy_Admin To Check if user exist use the following address with a GET requesthttp://localhost:8080/bookStock/isUserExist/userId=Dummy_User To Add new book to the stock, use the following address and POST a book object, if the book is already exist, then only the quantity will be updated otherwise a new book will be added.http://localhost:8080/bookStock/addBook To Check if a book exist use the following address and POST the book object.http://localhost:8080/bookStock/isBookExist To Add a new admin account POST the admin object to the following address:http://localhost:8080/bookStock/addNewAdmin Example of an admin object is as following: 123456789&#123;&quot;username&quot;: &quot;admin_user&quot;,&quot;password&quot;: &quot;admin_pass&quot;,&quot;firstname&quot;: &quot;admin_name&quot;,&quot;lastname&quot;: &quot;admin_lastname&quot;,&quot;address&quot;: admin_address,&quot;email&quot;: admin_email,&quot;personalnumber&quot;: 123456&#125; The password will be encrypted in the backend and will be stored in the database. Also there is a decryption algorithm when we want to decrypt the password.If the admin does not exist the new admin will be added, otherwise the request will be rejected. Security vulnerable?In real implementation the site needs to be https to avoid attackers sniffing the password.Also, all requests to server can use a token. The token is stored as cookie on user’s machine and can have expiry time for session invalidation. To Check if the admin password is correct use the following address and POST the user name and password:http://localhost:8080/bookStock/isAdminPasswordCorrect 1234&#123;&quot;username&quot;: &quot;admin_user&quot;,&quot;password&quot;: &quot;admin_pass&quot;&#125; To Add a new user use the following address and POST the user object to the server:http://localhost:8080/bookStock/addNewUser Example of a user object: 12345678 &#123;&quot;firstname&quot;: &quot;user_firstname&quot;,&quot;lastname&quot;: &quot;user_lastname&quot;,&quot;address&quot;: user_address,&quot;email&quot;: user_email,&quot;userid&quot;: &quot;user_uniqueId&quot;,&quot;personalnumber&quot;: 1234&#125; Running the testsThis project is using SQLite database, so for the testing purposes a new database (BookShopTest.db) will be created for only tests. Run the following Maven command to test: mvn test Link to source codehttps://github.com/AhmadVakil/REST-BookStore-API","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"The very professional web shop","slug":"work-samples","date":"2019-08-04T14:18:24.668Z","updated":"2019-08-04T14:18:24.695Z","comments":true,"path":"2019/08/04/work-samples/","link":"","permalink":"http://yoursite.com/2019/08/04/work-samples/","excerpt":"","text":"Our web shop product: This is a very professional web shop with CMS feature for those who wants to sell products, such as, handmade products, beauty and personal care products, pet related products, clothes and more… The package comes with a user manual, remote support and we can also adjust the design the way you want it. What is CMS? CMS stands for “Content Management System”. A content management system manages the creation and modification of digital content. It supports multiple users in a collaborative environment. CMS features vary widely. They are widely used for either enterprise content management or web content management. For example, this post has been uploaded via CMS which basically you will login as the administrator and have access to all contents that are available in your website, web shop or your weblog. This web shop is mobile friendly and can adjust itself automatically to any device that you have. Also, it supported by most of the browsers. So, let’s have a look to this web shop… The main Mockup: The home page: Administrator login page The administrator dashboardAfter you have logged in as the admin, you will see the following page which is the main dashboard to control everything. As you can see there are lots of features and configuration in the left side menu. You are also able to give promotions to your customers and your visitors. Your promotions You can use this page if you want to give promotions. For example for mothers day, Christmas, valentine and more. Manage your customers Manage your orders Manage your orders and see who has ordered, what are the addresses and email addresses. That’s it, when you order something online from a website, the administrator of that website will see your order in their CMS and after you have made your payments they will send your product through their local post office from anywhere in the world. This is not magic, this is just a piece of software that we develop by spending too much time and effort in order to make a hard task as simple as possible. Customer login pageYour customers will be able to login from the following page. Customer profile page For more information, please contact us via email.","categories":[{"name":"Our products","slug":"Our-products","permalink":"http://yoursite.com/categories/Our-products/"}],"tags":[],"keywords":[{"name":"Our products","slug":"Our-products","permalink":"http://yoursite.com/categories/Our-products/"}]},{"title":"Where to buy from us?","slug":"The-first-post","date":"2019-08-02T14:55:00.812Z","updated":"2019-07-28T14:55:00.830Z","comments":true,"path":"2019/08/02/The-first-post/","link":"","permalink":"http://yoursite.com/2019/08/02/The-first-post/","excerpt":"","text":"We have created this weblog so we can spread news about our activities and our awesome works. You can visit “Our products &amp; news” to see our previous works, our designs and our news. Are you interested in our works?If you are in Sweden, by clicking the B icon in the top right corner you will be redirected to our latest advertisement on Blocket.se If you are not in Sweden, click on the E icon in the top right corner to order from Etsy.com At the moment we only accept orders from the above websites. We are always here to support you, so if you have a question feel free to contact us anytime and we will get back to you within 24 hours.","categories":[{"name":"Our products","slug":"Our-products","permalink":"http://yoursite.com/categories/Our-products/"}],"tags":[],"keywords":[{"name":"Our products","slug":"Our-products","permalink":"http://yoursite.com/categories/Our-products/"}]},{"title":"The Smart Home and Our Connected Life","slug":"the-smart-home","date":"2019-08-02T05:03:41.000Z","updated":"2019-08-02T05:03:41.000Z","comments":true,"path":"2019/08/02/the-smart-home/","link":"","permalink":"http://yoursite.com/2019/08/02/the-smart-home/","excerpt":"","text":"The Smart Home and Our Connected Life Almost everything today is digitally connected, whether at home or on the go. Connected technology saves you time with everything from smart phones to smart homes!Tech Lifestyle Expert Carley Knobloch has partnered with KillerApps.com and four brands for a look at some great smart tech for 2019 that will help simplify your life.First up … a laptop is a must! Made for today’s mobile multi-taskers, the thin and light Yoga C630 combines the power and productivity of a Windows 10 laptop with the always-on, always-connected mobility of a smartphone thanks to integrated 4G LTE and Wi-Fi support. Powered by Qualcomm’s Snapdragon 850 Mobile Compute Platform, the Yoga C630 gets up to 22 hours of local video playback and features a natural pen-on-paper experience on its vibrant 13.3-inch FHD IPS touchscreen display with optional Lenovo Pen and Windows Ink.Next, to stay connected at home, Orbi Voice is a smart speaker integrated with Amazon voice assistant, Alexa and uses the Qualcomm Wifi Mesh platform to create expansive whole home Wi-Fi coverage (up to 4500 square feet) to create an entire ecosystem of mesh Wi-Fi products. It also features premium audio technology, creating incredible room-filling sound from the audio experts at Harman Kardon. Alexa makes it easy to play music from the most popular streaming services, control other IoT devices, check traffic, weather, and so much more – without needing a separate device. It’s truly an innovative leap, and the start of a trend expected to accelerate in the 5G era.Smart products can also help keep families safe. Fire is getting faster, but you can get ahead by installing Kidde Wire-Free Interconnect Smoke Alarms in your home. Kidde’s new interconnect alarm solution offers exceptional safety benefits without the hassle of hardwiring or a Wi-Fi connection. The interconnect technology helps alert you to a fire no matter where you are in your home. When one alarm senses a hazard, all interconnected alarms sound throughout the home. The alarm also comes with a sealed 10-year battery, which you don’t have to worry about changing alarms batteries. Simply replace the entire alarm after 10 years.Home security solutions are getting smarter and more convenient too. Schlage Encode is the newest connected device to enhance the brand’s portfolio of innovative smart locks. The deadbolt is easy to install, with a quick connection to in-home WiFi, making it even more convenient for homeowners to have secure, remote access control. The built-in Wi-Fi technology eliminates the need for an additional hub and allows users to set-up and manage the lock via the Schlage Home or Key by Amazon apps. This means users can lock and unlock their deadbolt, monitor the lock’s status, and send virtual keys to trusted friends and family, all from the convenience of their smartphone. Homeowners can create up to 100 unique guest access codes for temporary, recurring or permanent access. This information, along with the lock’s activity, can be tracked and monitored within the app, giving homeowners greater peace of mind. Through the Schlage Home app, users can also pair their deadbolt with Google Assistant and Amazon Alexa. When managing the lock via the Key app, users can enjoy compatibility with other platforms such as Amazon Cloud Cam, Ring video doorbell and cameras, and Alexa.For more information, visit KillerApps.com.","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"Digital Frame Brings Families Together","slug":"digital-frame-brings-families-together","date":"2019-05-04T06:42:55.000Z","updated":"2019-05-04T06:42:55.000Z","comments":true,"path":"2019/05/04/digital-frame-brings-families-together/","link":"","permalink":"http://yoursite.com/2019/05/04/digital-frame-brings-families-together/","excerpt":"","text":"Digital Frame Brings Families Together Today’s social media platforms allow most people to stay constantly connected to family and friends, but the elderly, military, or loved ones in other time zones may not have the access or ability to use social media.An interactive digital photo frame such as Skylight Frame helps families stay connected when other social media options are difficult.For example, this solution has brought joy to a young boy who is being treated for a brain tumor and has to spend long periods of time away from home at the hospital. He now receives photos from his classmates back home through Skylight Frame.”This little boy is one brave kid. He has been through so much and anything that can brighten his day is a winner in my book,” says the boy’s cousin, who rallied friends to purchase the frame. “Skylight Frame has been a way for friends all over to share some love,” she says.Each Skylight has its own unique email address where friends and family can send photos to – and they appear on the frame in seconds!The key benefits of Skylight digital frame are ease of use and interactive features. Just plug in the frame and tap the screen to log in to WiFi and email photos to it! A visual notification appears when new photos arrive. In addition, users can tap a Heart button to thank senders or show they especially liked a particular photo.Skylight’s Plus plan also allows you to send videos to the frame, add captions to photos, and manage it all from its mobile app and cloud portal. This makes it easy for anyone to gift it to an older loved one, and then manage the frame remotely.","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"A New Perspective on Robots and How They Will Shape Humanity","slug":"a-new-perspective-on-robots-and-how-they-will-shape-humanity","date":"2018-07-07T16:49:44.000Z","updated":"2018-07-07T16:49:44.000Z","comments":true,"path":"2018/07/07/a-new-perspective-on-robots-and-how-they-will-shape-humanity/","link":"","permalink":"http://yoursite.com/2018/07/07/a-new-perspective-on-robots-and-how-they-will-shape-humanity/","excerpt":"","text":"A New Perspective on Robots and How They Will Shape Humanity (NewsUSA) – Throughout the years, technology has improved drastically – creating machines and devices that were unimaginable 50 years ago. And perhaps the most advanced and interesting of society’s technological advancements is robots – but it is also the most misunderstood. In fact, according to recent Pew Research, more than 70 percent of Americans express concern about a world in which machines perform many of the tasks done by humans. Fortunately, there are people who believe humans and robots can coexist and work together in harmony and are working to debunk many of the fears people have about them. Mouser Electronics Inc., a leading semiconductor and electronics component distributor based in Fort Worth, TX, and celebrity engineer Grant Imahara, have teamed up again for the fourth consecutive year for their Empowering Innovation Together program. This year’s program is called Generation Robot, which features five videos filmed across the world, including in the U.S., Germany and Japan. Mouser’s goal is to reach innovators around the globe by showing how robots have a positive impact on humanity and change how people see the possibility of interacting with them. Throughout the Generation Robot series, the entire spectrum of robotics will be examined, as will the understanding of how robots not only have a technological impact on society, but also a social and moral one.The video series begins with the Imahara visiting the Institute for Robotics and Intelligent Machines at Georgia Tech and speaking with the executive director, Dr. Magnus Egerstedt.There, he explores several aspects of robots, such as the basics of the machines, myths and misconceptions, as well as the hopes for, and fears of, the advancement of robot technology. In the video, Dr. Egerstedt mentions that robots used to be about mechanical engineering, but now modern robots involve psychology, because these machines will be working along with humans and thus they need to understand people. The second video, which takes place in Augsburg, Germany, dives into the real meaning of robots and humans working together, as well as the way this interaction will benefit society.The third video, which comes out in mid-July, will focus on the all-robot-staffed hotel in Nagasaki, Japan, where Imahara investigates the way robots behave utilizing only artificial intelligence.To watch all the videos and learn more about Mouser and Generation Robot, visit https://www.mouser.com/empowering-innovation. Tweet","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"Ballistic missiles programming languages and how it works?","slug":"how-ballistic-works","date":"2018-07-03T03:57:33.000Z","updated":"2018-07-03T03:57:33.000Z","comments":true,"path":"2018/07/03/how-ballistic-works/","link":"","permalink":"http://yoursite.com/2018/07/03/how-ballistic-works/","excerpt":"","text":"Ballistic missiles programming languages and how it works? Today with the use of programming, life is easier, and most of the tedious tasks are simplified for us since the computer, or our smart phones helps us in our daily basis life. This simplification can also leave a huge impact on our life on earth which is the use of technology by governments to defend themselves. The most and dangerous technology that is used today by militaries or even terrorism oganizations are ballistic missiles that can target enemies or innocent people far from the launch point. These missiles mostly using C programming languages, C++ and also Ada. These programming languages can be vulnerable if an attacker find an exploit within the system which will end up in controlling the missile by unauthorized people, terrorism organizations or governments. Cybersecurity can be used to secure us from cyber attacks. Attackers might try to steal our information inorder to use them for malicious purposes or even find vulnerabilities for an organization and get a prise. On the other hand, cyber attacks can both secure and insecure our surrounding world. Imagine a terrorist organization that use cyber attacks to take control of military equipments for malicious puposes and on the other side imagine an attacker who tries to stop these malicious activities. As mentioned, finding and fixing vulnerabilities in military equipments is vital which will also help terrorism organizations to be more secure too if they find the solution on how to fix their current bugs. As an example we can think about how a Ballistic missile works and how does it reach its target? By hacking a missile it is possible to take control of launch time and the target. In order to defend against Ballistic missile, military bases uses satellite technology which consist of an infrared equipped satellite which detect the exact location of the missile and a communication satellite that send&#x2F;receive data from the infrared satellite to the ground based military with air defence weapon. The interesting part is to estimate exactly the time and the location that the defence rocket reach the ballistic missile in the air which will be calculated using trajectory formula as following. y &#x3D; h + xtan(α) - gx²&#x2F;2V₀²cos²(α) What is the definition of trajectory? Trajectory, likewise called a flight way which help us to guess an estimated point. It is the way followed by a moving item with gravity. Typically, the term is used with satellites and moving objects. If an item is fired to a distance target, at that point a parabola is a guess of the direction. Example of such: Path of a ping pong ball bouncing while on the air Path of a rocket fire to a target while on the air Path of a basketball while in the air What is the trajectory formula?Now we know what is the trajectory, let’s dig deeper into the formula: 1- So, motion equations are: x &#x3D; Vx * ty &#x3D; h + Vy * t - g * t² &#x2F; 2 2- We have three Vx, Vy and V₀ form a right triangle, we can write that: Vx is equal to V₀ * cos(α)Vy &#x3D; V₀ * sin(α) 3- Then, we mix up the equations of motion &amp; velocity components into a single formula: x &#x3D; Vx * t &#x3D;&gt; t &#x3D; x &#x2F; Vxy &#x3D; h + Vy * t - g * t² &#x2F; 2 &#x3D; h + x * Vy &#x2F; Vx - g * (x &#x2F; Vx)² &#x2F; 2y &#x3D; h + x * (V₀ * sin(α)) &#x2F; (V₀ * cos(α)) - g * (x &#x2F; V₀ * cos(α))² &#x2F; 2 Sine over cosine is a definition of tangent. So, the final trajectory formula is: y &#x3D; h + x * tan(α) - g * x² &#x2F; 2 * V₀² * cos²(α) Following is a video which demonstrate the use of Ballistic missile.","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"Who is a system developer?","slug":"who-is-a-system-developer","date":"2018-06-05T14:18:08.732Z","updated":"2018-06-05T14:18:00.000Z","comments":true,"path":"2018/06/05/who-is-a-system-developer/","link":"","permalink":"http://yoursite.com/2018/06/05/who-is-a-system-developer/","excerpt":"","text":"Systems developers create and develop data&#x2F;IT systems or parts of these systems. This might involve developing everything from financial systems to systems for controlling industrial production. Programming is often the core of the systems developer’s work. It is important to be logical and creative and to be able to work well with others.","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"Catch the creature game in Java","slug":"a-java-game","date":"2017-08-01T20:36:00.000Z","updated":"2017-08-01T20:36:00.000Z","comments":true,"path":"2017/08/02/a-java-game/","link":"","permalink":"http://yoursite.com/2017/08/02/a-java-game/","excerpt":"","text":"Catch the creature game in Java Catch the creature game is a game that you have to click on the creature once it appears on the screen. As much as you catch the creature, it appears faster and hide faster. This Java program is the demonstration of this game which you can get bonus as much as you play. You also have the option to choose your creature, for example a PNG file that represent a creature. This is also a good practice to learn how to develop games in Java using JavaFX. 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687888990919293949596979899100101102103104105106107108109110111112113114115116117118119120121122123124import java.util.Random;import javafx.animation.AnimationTimer;import javafx.application.Application;import javafx.event.ActionEvent;import javafx.event.EventHandler;import javafx.geometry.Insets;import javafx.scene.Group;import javafx.scene.Scene;import javafx.scene.control.Button;import javafx.scene.control.Label;import javafx.scene.control.TextField;import javafx.scene.layout.HBox;import javafx.scene.text.Font;import javafx.stage.Stage;public class Catch_the_Creature extends Application &#123; public static int ClickedTime=0; public String path=&quot;&quot;; public Creature myCreature; public String DefaultImage=&quot;http://vignette4.wikia.nocookie.net/callofduty/images/5/5b/Specialty_airdrop_juggernaut_small.png/revision/latest?cb=20111112094909&quot;; public void start(Stage MyStage) throws InterruptedException &#123; Label URL = new Label(); URL.setText(&quot;Please paste the URL address of the PNG/JPG icon to use it as our player:\\nOr press OK to use default online Image.&quot;); URL.setFont(Font.font (&quot;Arial&quot;, 17)); Label Clicked=new Label(); TextField URLAddress=new TextField(); URLAddress.setPrefSize(700, 15); Button OK = new Button(); OK.setPrefSize(140, 50); OK.setText(&quot;OK&quot;); OK.setFont(Font.font (&quot;Arial&quot;, 17)); Stage URLStage = new Stage(); URLStage.setResizable(false); HBox HB=new HBox(); HB.getChildren().addAll(URL,URLAddress,OK); HBox.setMargin(URLAddress, new Insets(50,0,0,-560)); HBox.setMargin(OK, new Insets(100,0,0,-140)); OK.setOnAction(new EventHandler&lt;ActionEvent&gt;() &#123; public void handle(ActionEvent event) &#123; if(URLAddress.getText().isEmpty())&#123; myCreature.URLadr=myCreature.DefaultImage; URLStage.close(); &#125;else&#123; Creature MyCreature =new Creature(); MyCreature.URLadr=URLAddress.getText(); URLStage.close(); &#125; &#125; &#125;); Scene URLScene = new Scene(HB, 700, 150); URLStage.setScene(URLScene); URLStage.showAndWait(); Group MainPane=new Group(); MainPane.getChildren().addAll(Creature.Creature()); Group Labels= new Group(); Labels.getChildren().addAll(Clicked); Stage ScoreStage = new Stage(); ScoreStage.setResizable(false); Scene ScoreScene = new Scene(Labels, 250, 150); ScoreStage.setScene(ScoreScene); ScoreStage.setTitle(&quot;Your Scores&quot;); Clicked.setFont(Font.font (&quot;Arial&quot;, 20)); Scene MyScene = new Scene(MainPane, 690, 690); MyStage.setResizable(false); MyStage.setScene(MyScene); MyStage.show(); ScoreStage.show(); new AnimationTimer() &#123; boolean Appear = true; int Time = 0; @Override public void handle(long now) &#123; Random a=new Random(); int xx=a.nextInt(500); int yy=a.nextInt(500); if(Appear) &#123; if(Time &lt;= 200) Time += 10; else if(Time &gt;= 200) Appear=false; &#125; else &#123; if(Time &gt;= 0) Time -= 30; else if (Time &lt;= 0) Appear = true; &#125; if (Time==200)&#123; MainPane.setTranslateX(xx); MainPane.setTranslateY(yy); Clicked.setText(&quot; You could Click: &quot;+Creature.MouseClickedMain+&quot; Times&quot;); if (Creature.MouseClickedMain&gt;5)&#123; Clicked.setText(&quot; You could Click: &quot;+Creature.MouseClickedMain+&quot; Times\\nWOW! You Are Fast&quot;); &#125; &#125; &#125; &#125;.start(); &#125; public static void main(String[] args) &#123; Application.launch(args); &#125;&#125;","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"CI/CD (Continuous Integration Continuous Delivery)","slug":"cicd","date":"2017-05-03T20:36:00.000Z","updated":"2017-05-03T20:36:00.000Z","comments":true,"path":"2017/05/04/cicd/","link":"","permalink":"http://yoursite.com/2017/05/04/cicd/","excerpt":"","text":"What is CI&#x2F;CD? In software engineering, CI&#x2F;CD or CICD refer to the combined practices of continuous integration and continuous delivery.Watch this video to learn more about this useful method.","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"Protecting Seniors Online from Scams, Hacks and Tax Fraud","slug":"protecting-seniors-online-from-scams-hacks-and-tax-fraud","date":"2017-02-18T15:50:34.000Z","updated":"2022-12-25T15:15:21.666Z","comments":true,"path":"2017/02/18/protecting-seniors-online-from-scams-hacks-and-tax-fraud/","link":"","permalink":"http://yoursite.com/2017/02/18/protecting-seniors-online-from-scams-hacks-and-tax-fraud/","excerpt":"","text":"Protecting Seniors Online from Scams, Hacks and Tax Fraud (NewsUSA) The vast majority of seniors today are using the Internet at least once a week to check email, pay bills online and keep in touch via social media. But all that time online puts them at risk for scams and hacks, such as tax fraud. In fact, a new survey by Home Instead, Inc., franchisor of the Home Instead Senior Care network, found that 67 percent of surveyed older adults have been the victim of an online scam or hack. Encouraging seniors to practice cyber security can go a long way toward protecting their identity and sensitive financial information. Home Instead collaborated with the National Cyber Security Alliance to create Protect Seniors Online, available at www.ProtectSeniorsOnline.com, a free resource that educates older adults about cybersecurity. Here, seniors can test their cybersecurity skills with the “Can You Spot an Online Scam?” quiz. Older adults can take the following steps now to protect themselves online: Password protect and secure devices, accounts. Lock all devices (including computers, tablets and smartphones) with secure passwords in case devices are lost or stolen. Think before clicking or get a second opinion. Clicking on links is often how scammers get personal information. When in doubt, trash an unusual message. Share with care. More than half (51 percent) of seniors surveyed by Home Instead use social media to stay connected. Use care when sharing personal information, adjust privacy settings to limit who can see your information, and turn off location sharing. Use security software. Install anti-virus and anti-spyware software and program it to run regularly. And be wary of pop-up ads or emails, many of which contain malware that can infect computers. Log out. Log out of apps and websites when you are finished. Leaving apps and websites open on computer screens could make you vulnerable to security and privacy risks. Recommend support. Older adults who live alone may need help from a trusted source such as a family member, tech-savvy friend or professional caregiver to serve as a second set of eyes. To explore additional Protect Seniors Online resources, including the interactive quiz, visit www.ProtectSeniorsOnline.com. A Home Instead office near you can be found by visiting www.homeinstead.com/state. Tweet","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"IntelliJ IDEA Tips and Tricks","slug":"intellij-idea-tips","date":"2017-02-13T09:18:00.000Z","updated":"2022-12-25T15:15:21.663Z","comments":true,"path":"2017/02/13/intellij-idea-tips/","link":"","permalink":"http://yoursite.com/2017/02/13/intellij-idea-tips/","excerpt":"","text":"IntelliJ IDEA Tips and Tricks Beside Eclipse, one of our favorite code editors is IntelliJ IDEA which is a powerful code editor with too many shortcuts to help you just focus on the code. If you have one hour of time to learn new things then watch this video to learn 42 tips in this awesome code editor.","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"Spring boot REST example","slug":"spring-boot-rest-example","date":"2017-01-18T10:32:12.307Z","updated":"2017-01-18T10:32:00.000Z","comments":true,"path":"2017/01/18/spring-boot-rest-example/","link":"","permalink":"http://yoursite.com/2017/01/18/spring-boot-rest-example/","excerpt":"","text":"Spring boot is sub-project developed by developers of spring framework – to create stand-alone, production-grade application with minimum configuration possible. Spring boot applications are typically bundled as fat&#x2F;uber jar files and can be deployed in any platform as a simple jar file. This is why spring boot applications are a good candidate for building microservices in java. Let’s learn it by starting with a spring boot hello world example in eclipse step by step. Create spring boot hello world project template To create a template for spring boot application, I will suggest to use http://start.spring.io/. Here, you can select all dependencies which you have currently in mind, and generate the project. I have selected dependencies like Jersey, Spring Web, Spring HATEOAS, Spring JPA and Spring Security etc. You can add more dependencies after you have downloaded and imported the project or in future when requirements arise. Generate Project button will generate a .zip file. Download and extract the file into your workspace. Import spring boot project to eclipse Next step is to import the generated project into your IDE. I have used eclipse for this purpose. Import the spring boot project as existing maven project. Select the pom.xml file to import it. Project will be imported and the dependencies you added while generating zip file, will be automatically downloaded and added into classpath. You have now successfully imported spring boot application. Now let’s see what it has already configured for you. Spring boot auto configuration With spring boot, good thing is when you add a dependency (e.g. Spring security), it make fair assumptions and automatically configure some defaults for you. So you can start immediately. Spring Boot uses convention over configuration by scanning the dependent libraries available in the class path. For each spring-boot-starter-* dependency in the POM file, Spring Boot executes a default AutoConfiguration class. AutoConfiguration classes use the *AutoConfiguration lexical pattern, where * represents the library. For example, the autoconfiguration of spring security is done through SecurityAutoConfiguration. At the same time, if you don’t want to use auto configuration for any project, it makes it very simple. Just use exclude &#x3D; SecurityAutoConfiguration.class like below. 1234567@SpringBootApplication (exclude = SecurityAutoConfiguration.class)public class SpringBootDemoApplication &#123;public static void main(String[] args) &#123; SpringApplication.run(SpringBootDemoApplication.class, args); &#125;&#125; It is also possible to override default configuration values using the application.properties file in src&#x2F;main&#x2F;resources folder. Spring boot annotations Now look at @SpringBootApplication annotation what it actually does. 4.1. @SpringBootApplication annotation SpringBootApplication is defined as below: 12345678910@Target(ElementType.TYPE)@Retention(RetentionPolicy.RUNTIME)@Documented@Inherited@SpringBootConfiguration@EnableAutoConfiguration@ComponentScan(excludeFilters = @Filter(type = FilterType.CUSTOM, classes = TypeExcludeFilter.class))public @interface SpringBootApplication&#123; //more code&#125; It adds 3 important annotations for application configuration purpose. @SpringBootConfiguration 12345@Configurationpublic @interface SpringBootConfiguration&#123; //more code&#125; This annotation adds @Configuration annotation to class which mark the class a source of bean definitions for the application context. @EnableAutoConfiguration This tells spring boot to auto configure important bean definitions based on added dependencies in pom.xml by start adding beans based on classpath settings, other beans, and various property settings. @ComponentScan This annotation tells spring boot to scan base package, find other beans&#x2F;components and configure them as well. How to verify auto-configured beans by spring boot If you ever want to know what all beans have been automatically configured into your spring boot hello world application, then use this code and run it. 1234567891011121314151617import java.util.Arrays;import org.springframework.boot.SpringApplication;import org.springframework.boot.autoconfigure.SpringBootApplication;import org.springframework.boot.autoconfigure.security.SecurityAutoConfiguration;import org.springframework.context.ApplicationContext;@SpringBootApplication (exclude = SecurityAutoConfiguration.class)public class SpringBootDemoApplication &#123; public static void main(String[] args) &#123; ApplicationContext ctx = SpringApplication.run(SpringBootDemoApplication.class, args); String[] beanNames = ctx.getBeanDefinitionNames(); Arrays.sort(beanNames); for (String beanName : beanNames) &#123; System.out.println(beanName); &#125; &#125;&#125; With my pom.xml file, it generates following beans names along with plenty of other springframework.boot.autoconfigure dependencies. 123456789101112131415161718192021222324simpleControllerHandlerAdaptersortResolverspring.datasource-org.springframework.boot.autoconfigure.jdbc.DataSourcePropertiesspring.hateoas-org.springframework.boot.autoconfigure.hateoas.HateoasPropertiesspring.http.encoding-org.springframework.boot.autoconfigure.web.HttpEncodingPropertiesspring.http.multipart-org.springframework.boot.autoconfigure.web.MultipartPropertiesspring.info-org.springframework.boot.autoconfigure.info.ProjectInfoPropertiesspring.jackson-org.springframework.boot.autoconfigure.jackson.JacksonPropertiesspring.jpa-org.springframework.boot.autoconfigure.orm.jpa.JpaPropertiesspring.jta-org.springframework.boot.autoconfigure.transaction.jta.JtaPropertiesspring.mvc-org.springframework.boot.autoconfigure.web.WebMvcPropertiesspring.resources-org.springframework.boot.autoconfigure.web.ResourcePropertiesspringBootDemoApplicationstandardJacksonObjectMapperBuilderCustomizerstringHttpMessageConvertertomcatEmbeddedServletContainerFactorytomcatPoolDataSourceMetadataProvidertransactionAttributeSourcetransactionInterceptortransactionManagertransactionTemplateviewControllerHandlerMappingviewResolverwebsocketContainerCustomizer Spring boot REST API example Now it’s time to build any functionality into hello world application. You can add functionality as per your need, I am adding a REST API. 6.1. Create REST Controller Create a package com.howtodoinjava.demo.controller and create rest controller inside it. 1234567891011121314151617import java.util.ArrayList;import java.util.List;import org.springframework.web.bind.annotation.RequestMapping;import org.springframework.web.bind.annotation.RestController;import com.howtodoinjava.demo.model.Employee; @RestControllerpublic class EmployeeController&#123; @RequestMapping(&quot;/&quot;) public List&lt;Employee&gt; getEmployees() &#123; List&lt;Employee&gt; employeesList = new ArrayList&lt;Employee&gt;(); employeesList.add(new Employee(1,&quot;lokesh&quot;,&quot;gupta&quot;,&quot;howtodoinjava@gmail.com&quot;)); return employeesList; &#125;&#125; 6.2. Create Model Create model class Employee. 1234567891011121314151617181920212223242526public class Employee &#123; public Employee() &#123; &#125; public Employee(Integer id, String firstName, String lastName, String email) &#123; super(); this.id = id; this.firstName = firstName; this.lastName = lastName; this.email = email; &#125; private Integer id; private String firstName; private String lastName; private String email; //getters and setters @Override public String toString() &#123; return &quot;Employee [id=&quot; + id + &quot;, firstName=&quot; + firstName + &quot;, lastName=&quot; + lastName + &quot;, email=&quot; + email + &quot;]&quot;; &#125;&#125; Spring boot hello world example demo Now start the application by running main() method in SpringBootDemoApplication. It will start the embedded tomcat server on port 8080. As we have configured the demo REST API URL to root URL, you can access it on http;&#x2F;&#x2F;localhost:8080&#x2F; itself. You will get the below response in testing tool or browser. [{“id”:1,”firstName”:”lokesh”,”lastName”:”gupta”,”email”:”&#104;&#x6f;&#119;&#x74;&#111;&#x64;&#111;&#105;&#x6e;&#x6a;&#97;&#118;&#x61;&#x40;&#103;&#x6d;&#x61;&#105;&#x6c;&#x2e;&#x63;&#111;&#109;“}] That’s all for this spring boot rest hello world example with simple rest api example. Drop me your questions related to how to create spring boot project in eclipse using maven. Happy Learning !!","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"Jenkins in five minutes!","slug":"jenkins-in-five-min","date":"2017-01-11T06:55:43.606Z","updated":"2022-12-25T15:15:21.663Z","comments":true,"path":"2017/01/11/jenkins-in-five-min/","link":"","permalink":"http://yoursite.com/2017/01/11/jenkins-in-five-min/","excerpt":"","text":"What is Jenkins? Jenkins is an open source automation server written in Java. Jenkins helps to automate the non-human part of the software development process, with continuous integration and facilitating technical aspects of continuous delivery. It is a server-based system that runs in servlet containers such as Apache Tomcat. Watch this video to learn more.","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"How to Protect Your Data in a Connected World","slug":"how-to-protect-your-data-in-a-connected-world","date":"2017-01-10T18:04:29.000Z","updated":"2022-12-25T15:15:21.663Z","comments":true,"path":"2017/01/10/how-to-protect-your-data-in-a-connected-world/","link":"","permalink":"http://yoursite.com/2017/01/10/how-to-protect-your-data-in-a-connected-world/","excerpt":"","text":"How to Protect Your Data in a Connected World (NewsUSA) For more information, please visit www.gemalto.com. The phrase ‘six degrees of separation,’ suggests that only a minuscule measurement is what divides one person from another. Today, the Internet of Things (IoT) has decreased those degrees dramatically, connecting us not only to each other, but to everything from our fitness trackers to our coffee makers.Consider this: according to a recent report by the Federal Trade Commission, the number of Internet-connected devices tops 25 billion worldwide. And that number is expected to double in the next five years, according to experts cited in the report.In a world where everyone and everything is connected, digital security is a must-have, just as important as the lock on your front door or the keys to your house.“Technology is revolutionizing the way consumers use cars, homes, work spaces and everyday items,” Rep. Darrell Issa, R- Calif., told USA Today in a recent interview. “These devices raise both opportunities and questions about regulatory policy, spectrum space, privacy and more.”Underscoring Issa’s concerns are high-profile hacks, including one that took remote control of a Jeep on a busy highway. Experts warn who consumers need to understand that, although convenient, the IoT is an interconnected system, and security is needed to prevent a weakness in one device (like a SmartWatch) from becoming an open door to attack in another device (such as a connected car).The good news is that sensitive industries such as banking, government, and healthcare have worked with companies like Gemalto, a global leader in digital security, to solve difficult security challenges. While most may not recognize the name “Gemalto,” experts say that almost everyone uses at least one or two of the company’s solutions, which are embedded in a wide variety of connected devices, credit cards, passports, and ID badges.So, to ensure that your data is protected from hackers, Gemalto recommends the following tips: Secure the device. Sensitive devices need an added layer of protection, such as a SIM card or a tamper-resistant Secure Element that stores data in a safe place. Control the access. Implement two-factor authentication to ensure that only authorized people are granted access to the data. Secure the data. Ensure that sensitive data is encrypted and that encryption keys are stored in a separate and safe place. Tweet","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"Malware attack","slug":"malware-attack","date":"2016-11-16T10:24:26.418Z","updated":"2016-11-16T10:24:00.000Z","comments":true,"path":"2016/11/16/malware-attack/","link":"","permalink":"http://yoursite.com/2016/11/16/malware-attack/","excerpt":"","text":"Malicious software can be described as unwanted software that is installed in your system without your consent. It can attach itself to legitimate code and propagate; it can lurk in useful applications or replicate itself across the Internet. Here are some of the most common types of malware: Macro viruses — These viruses infect applications such as Microsoft Word or Excel. Macro viruses attach to an application’s initialization sequence. When the application is opened, the virus executes instructions before transferring control to the application. The virus replicates itself and attaches to other code in the computer system. File infectors — File infector viruses usually attach themselves to executable code, such as .exe files. The virus is installed when the code is loaded. Another version of a file infector associates itself with a file by creating a virus file with the same name, but an .exe extension. Therefore, when the file is opened, the virus code will execute. System or boot-record infectors — A boot-record virus attaches to the master boot record on hard disks. When the system is started, it will look at the boot sector and load the virus into memory, where it can propagate to other disks and computers. Polymorphic viruses — These viruses conceal themselves through varying cycles of encryption and decryption. The encrypted virus and an associated mutation engine are initially decrypted by a decryption program. The virus proceeds to infect an area of code. The mutation engine then develops a new decryption routine and the virus encrypts the mutation engine and a copy of the virus with an algorithm corresponding to the new decryption routine. The encrypted package of mutation engine and virus is attached to new code, and the process repeats. Such viruses are difficult to detect but have a high level of entropy because of the many modifications of their source code. Anti-virus software or free tools like Process Hacker can use this feature to detect them. Stealth viruses — Stealth viruses take over system functions to conceal themselves. They do this by compromising malware detection software so that the software will report an infected area as being uninfected. These viruses conceal any increase in the size of an infected file or changes to the file’s date and time of last modification. Trojans — A Trojan or a Trojan horse is a program that hides in a useful program and usually has a malicious function. A major difference between viruses and Trojans is that Trojans do not self-replicate. In addition to launching attacks on a system, a Trojan can establish a back door that can be exploited by attackers. For example, a Trojan can be programmed to open a high-numbered port so the hacker can use it to listen and then perform an attack. Logic bombs — A logic bomb is a type of malicious software that is appended to an application and is triggered by a specific occurrence, such as a logical condition or a specific date and time. Worms — Worms differ from viruses in that they do not attach to a host file, but are self-contained programs that propagate across networks and computers. Worms are commonly spread through email attachments; opening the attachment activates the worm program. A typical worm exploit involves the worm sending a copy of itself to every contact in an infected computer’s email address In addition to conducting malicious activities, a worm spreading across the internet and overloading email servers can result in denial-of-service attacks against nodes on the network. Droppers — A dropper is a program used to install viruses on computers. In many instances, the dropper is not infected with malicious code and, therefore might not be detected by virus-scanning software. A dropper can also connect to the internet and download updates to virus software that is resident on a compromised system. Ransomware — Ransomware is a type of malware that blocks access to the victim’s data and threatens to publish or delete it unless a ransom is paid. While some simple computer ransomware can lock the system in a way that is not difficult for a knowledgeable person to reverse, more advanced malware uses a technique called cryptoviral extortion, which encrypts the victim’s files in a way that makes them nearly impossible to recover without the decryption key.","categories":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}],"tags":[],"keywords":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}]},{"title":"Hack CCTV camera","slug":"hack-cctv-camera","date":"2016-09-30T06:08:43.606Z","updated":"2018-06-24T05:10:00.000Z","comments":true,"path":"2016/09/30/hack-cctv-camera/","link":"","permalink":"http://yoursite.com/2016/09/30/hack-cctv-camera/","excerpt":"","text":"CCTV hack CCTV cameras are vulnerable, watch this video to understand how to find vulnerabilities in these type of cameras.","categories":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}],"tags":[],"keywords":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}]},{"title":"Buffer overflow attack","slug":"buffer-overflow-attack","date":"2016-09-24T04:08:43.606Z","updated":"2016-09-24T04:08:00.000Z","comments":true,"path":"2016/09/24/buffer-overflow-attack/","link":"","permalink":"http://yoursite.com/2016/09/24/buffer-overflow-attack/","excerpt":"","text":"What is buffer overflow attack? Watch this video to learn this type attack:","categories":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}],"tags":[],"keywords":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}]},{"title":"Not All Encryption Is Created Equal","slug":"not-all-encryption-is-created-equal","date":"2016-08-15T18:16:13.000Z","updated":"2022-12-25T15:15:21.665Z","comments":true,"path":"2016/08/15/not-all-encryption-is-created-equal/","link":"","permalink":"http://yoursite.com/2016/08/15/not-all-encryption-is-created-equal/","excerpt":"","text":"Not All Encryption Is Created Equal (NewsUSA) Despite constant news cycles of rampant data security breaches occurring everywhere from Fortune 500 companies to brand name retailers, and now, more alarmingly, to healthcare organizations, it seems that most people still have a laissez-faire attitude about encryption and protecting their personal information. One of the problems, experts say, is that most people believe that strong passwords are a fail-safe against getting hacked, when in reality, all they do is create a false sense of security. If, like most people, you’re unsure what all the hubbub is about surrounding end-to-end encryption, read on to get yourself educated. What You Should Know End-to-end encryption is a method of secure communication that prevents third-parties (hackers) from accessing data while it’s transferred from one device to another, according to one technology company. Translated, this means that any data that is sent cannot be seen by anyone in between — not your internet service provider, the company behind apps that are being created (hello, Facebook and Google) or the person in Nigeria that would like you to send him money that he promises to pay back. Likewise, encryption extends to all forms of communication so that no one can decipher or read conversations, or see photos or videos. It’s that simple. All Encryption Software Is Not The Same Now that you have a better understanding of what end-to-end encryption is and why it’s important, where to start? One answer that is easy and cost-efficient is the Gabriel app, available at the Apple App Store and the Google Play Store. Gabriel was designed and built with personal privacy and security as its foundation by VirnetX, an internet security software and technology company. For just $10 to $15 per year, users can take advantage of the Gabriel app and benefit from uncompromising CIA encryption technology that will secure everything from talk, video chat, text, email and even sharing photographs or documents. No one will be able to see, hear or intercept your communications except for the party you’re in contact with because Gabriel does not transmit or store data with any third party. It’s person-to-person, end-to-end encryption that all but eliminates hacking possibilities. Other benefits include: * Making free voice or video calls or sending instant messages to other Gabriel members. * Receiving seamless email. * Sharing pictures or files that can’t be intercepted. For more information, or to download Gabriel, please visit www.gabrielsecure.com. Tweet","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"Phishing and spear phishing attacks","slug":"phishing-and-spear-phishing-attacks","date":"2016-08-05T12:47:00.000Z","updated":"2016-08-05T12:47:00.000Z","comments":true,"path":"2016/08/05/phishing-and-spear-phishing-attacks/","link":"","permalink":"http://yoursite.com/2016/08/05/phishing-and-spear-phishing-attacks/","excerpt":"","text":"Phishing attack is the practice of sending emails that appear to be from trusted sources with the goal of gaining personal information or influencing users to do something. It combines social engineering and technical trickery. It could involve an attachment to an email that loads malware onto your computer. It could also be a link to an illegitimate website that can trick you into downloading malware or handing over your personal information. Spear phishing is a very targeted type of phishing activity. Attackers take the time to conduct research into targets and create messages that are personal and relevant. Because of this, spear phishing can be very hard to identify and even harder to defend against. One of the simplest ways that a hacker can conduct a spear phishing attack is email spoofing, which is when the information in the “From” section of the email is falsified, making it appear as if it is coming from someone you know, such as your management or your partner company. Another technique that scammers use to add credibility to their story is website cloning — they copy legitimate websites to fool you into entering personally identifiable information (PII) or login credentials. To reduce the risk of being phished, you can use these techniques: Critical thinking — Do not accept that an email is the real deal just because you’re busy or stressed or you have 150 other unread messages in your inbox. Stop for a minute and analyze the email. Hovering over the links — Move your mouse over the link, but do not click it! Just let your mouse cursor h over over the link and see where would actually take you. Apply critical thinking to decipher the URL. Analyzing email headers — Email headers define how an email got to your address. The “Reply-to” and “Return-Path” parameters should lead to the same domain as is stated in the email. Sandboxing — You can test email content in a sandbox environment, logging activity from opening the attachment or clicking the links inside the email. Resource: blog.netwrix.com","categories":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}],"tags":[],"keywords":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}]},{"title":"SQL injection attack","slug":"sql-injection-attack","date":"2016-07-27T20:34:24.167Z","updated":"2016-07-27T20:34:00.000Z","comments":true,"path":"2016/07/28/sql-injection-attack/","link":"","permalink":"http://yoursite.com/2016/07/28/sql-injection-attack/","excerpt":"","text":"SQL injection has become a common issue with database-driven websites. It occurs when a malefactor executes a SQL query to the database via the input data from the client to server. SQL commands are inserted into data-plane input (for example, instead of the login or password) in order to run predefined SQL commands. A successful SQL injection exploit can read sensitive data from the database, modify (insert, update or delete) database data, execute administration operations (such as shutdown) on the database, recover the content of a given file, and, in some cases, issue commands to the operating system. For example, a web form on a website might request a user’s account name and then send it to the database in order to pull up the associated account information using dynamic SQL like this: “SELECT * FROM users WHERE account &#x3D; ‘“ + userProvidedAccountNumber +”’;” While this works for users who are properly entering their account number, it leaves a hole for attackers. For example, if someone decided to provide an account number of “‘ or ‘1’ &#x3D; ‘1’”, that would result in a query string of: “SELECT * FROM users WHERE account &#x3D; ‘’ or ‘1’ &#x3D; ‘1’;” Because ‘1’ &#x3D; ‘1’ always evaluates to TRUE, the database will return the data for all users instead of just a single user. The vulnerability to this type of cyber security attack depends on the fact that SQL makes no real distinction between the control and data planes. Therefore, SQL injections work mostly if a website uses dynamic SQL. Additionally, SQL injection is very common with PHP and ASP applications due to the prevalence of older functional interfaces. J2EE and ASP.NET applications are less likely to have easily exploited SQL injections because of the nature of the programmatic interfaces available. In order to protect yourself from a SQL injection attacks, apply least0privilege model of permissions in your databases. Stick to stored procedures (make sure that these procedures don’t include any dynamic SQL) and prepared statements (parameterized queries). The code that is executed against the database must be strong enough to prevent injection attacks. In addition, validate input data against a white list at the application level. Resource: blog.netwrix.com","categories":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}],"tags":[],"keywords":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}]},{"title":"Drive-by attack","slug":"drive-by-attack","date":"2016-06-13T08:18:21.944Z","updated":"2016-06-13T08:18:00.000Z","comments":true,"path":"2016/06/13/drive-by-attack/","link":"","permalink":"http://yoursite.com/2016/06/13/drive-by-attack/","excerpt":"","text":"Drive-by download attacks are a common method of spreading malware. Hackers look for insecure websites and plant a malicious script into HTTP or PHP code on one of the pages. This script might install malware directly onto the computer of someone who visits the site, or it might re-direct the victim to a site controlled by the hackers. Drive-by downloads can happen when visiting a website or viewing an email message or a pop-up window. Unlike many other types of cyber security attacks, a drive-by doesn’t rely on a user to do anything to actively enable the attack — you don’t have to click a download button or open a malicious email attachment to become infected. A drive-by download can take advantage of an app, operating system or web browser that contains security flaws due to unsuccessful updates or lack of updates. To protect yourself from drive-by attacks, you need to keep your browsers and operating systems up to date and avoid websites that might contain malicious code. Stick to the sites you normally use — although keep in mind that even these sites can be hacked. Don’t keep too many unnecessary programs and apps on your device. The more plug-ins you have, the more vulnerabilities there are that can be exploited by drive-by attacks. Resource: blog.netwrix.com","categories":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}],"tags":[],"keywords":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}]},{"title":"Encryption Technology for Your Privacy","slug":"encryption-technology-for-your-privacy","date":"2016-05-07T14:28:37.000Z","updated":"2022-12-25T15:15:21.661Z","comments":true,"path":"2016/05/07/encryption-technology-for-your-privacy/","link":"","permalink":"http://yoursite.com/2016/05/07/encryption-technology-for-your-privacy/","excerpt":"","text":"Encryption Technology for Your Privacy Encryption and controversy seem to go hand in hand lately in the technology community. Case in point: When The FBI sought to compel Apple to assist in unlocking a cell phone in the case of the San Bernardino shooter last December. Ultimately the FBI was denied its request by a California district court. This type of technology can be a gray area, yet one that tech companies take seriously. On the one hand, the government insists it needs access to technology in which crimes have been perpetrated, noting that encryption also allows terrorists to communicate in ways that agencies can’t track — all the while, using encryption to secure its own communication. Privacy advocates argue that if the government is using it, private citizens should be allowed to as well, without prying eyes looking over their collective shoulder. To that point, one company that has come down firmly on the side of citizens and their right to privacy is VirnetX. The software and technology company said it believes in personal privacy and that strong encryption is imperative in protecting those rights. VirnetX has been so focused on providing secure communications using encryption that it designed an app called Gabriel. Gabriel uses encryption technology derived from a CIA national security project, and is one of a kind. “Gabriel has been designed and built with personal privacy and security as a foundational principle,” says Dr. Robert Short, VirnetX chief technical officer and chief scientist. To that end, the program currently provides uncompromising data security, which means that users do not have to transmit data to, or store data with, any third party, including VirnetX. Users can therefore have peace of mind that their data is stored only on their devices, be it phone, tablet or computer. Gabriel is a product unto itself and can be found in Apple’s App store, the Google Play store or gabrielsecure.com. This set of integrated applications allows for secure messaging, secure voice and video calling, secure mail and secure file sharing — all encrypted. Other benefits to using Gabriel’s encrypted apps include: Making free voice or video calls or sending instant messages to other Gabriel members in your network. Receiving spamless email. Allowing for person-to-person messages that disappear once the session has ended. Sharing pictures or files that can’t be intercepted. Gabriel transmits person-to-person with end-to-end encryption to further eliminate hacking possibilities.For more information or to download Gabriel, go to www.gabrielsecure.com. Tweet","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"MitM attack","slug":"mitm-attack","date":"2016-04-04T13:10:23.432Z","updated":"2016-04-04T13:10:00.000Z","comments":true,"path":"2016/04/04/mitm-attack/","link":"","permalink":"http://yoursite.com/2016/04/04/mitm-attack/","excerpt":"","text":"A MitM attack occurs when a hacker inserts itself between the communications of a client and a server. Here are some common types of man-in-the-middle attacks: Session hijacking In this type of MitM attack, an attacker hijacks a session between a trusted client and network server. The attacking computer substitutes its IP address for the trusted client while the server continues the session, believing it is communicating with the client. For instance, the attack might unfold like this: A client connects to a server. The attacker’s computer gains control of the client. The attacker’s computer disconnects the client from the server. The attacker’s computer replaces the client’s IP address with its own IP address and spoofs the client’s sequence numbers. The attacker’s computer continues dialog with the server and the server believes it is still communicating with the client. IP Spoofing IP spoofing is used by an attacker to convince a system that it is communicating with a known, trusted entity and provide the attacker with access to the system. The attacker sends a packet with the IP source address of a known, trusted host instead of its own IP source address to a target host. The target host might accept the packet and act upon it. Replay A replay attack occurs when an attacker intercepts and saves old messages and then tries to send them later, impersonating one of the participants. This type can be easily countered with session timestamps or nonce (a random number or a string that changes with time). Currently, there is no single technology or configuration to prevent all MitM attacks. Generally, encryption and digital certificates provide an effective safeguard against MitM attacks, assuring both the confidentiality and integrity of communications. But a man-in-the-middle attack can be injected into the middle of communications in such a way that encryption will not help — for example, attacker “A” intercepts public key of person “P” and substitute it with his own public key. Then, anyone wanting to send an encrypted message to P using P’s public key is unknowingly using A’s public key. Therefore, A can read the message intended for P and then send the message to P, encrypted in P’s real public key, and P will never notice that the message was compromised. In addition, A could also modify the message before resending it to P. As you can see, P is using encryption and thinks that his information is protected but it is not, because of the MitM attack. So, how can you make sure that P’s public key belongs to P and not to A? Certificate authorities and hash functions were created to solve this problem. When person 2 (P2) wants to send a message to P, and P wants to be sure that A will not read or modify the message and that the message actually came from P2, the following method must be used: P2 creates a symmetric key and encrypts it with P’s public key. P2 sends the encrypted symmetric key to P. P2 computes a hash function of the message and digitally signs it. P2 encrypts his message and the message’s signed hash using the symmetric key and sends the entire thing to P. P is able to receive the symmetric key from P2 because only he has the private key to decrypt the encryption. P, and only P, can decrypt the symmetrically encrypted message and signed hash because he has the symmetric key. He is able to verify that the message has not been altered because he can compute the hash of received message and compare it with digitally signed one. P is also able to prove to himself that P2 was the sender because only P2 can sign the hash so that it is verified with P2 public key. Resource: blog.netwrix.com","categories":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}],"tags":[],"keywords":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}]},{"title":"DDoS attacks","slug":"ddos-attacks","date":"2016-03-23T22:08:43.606Z","updated":"2016-03-23T22:08:00.000Z","comments":true,"path":"2016/03/24/ddos-attacks/","link":"","permalink":"http://yoursite.com/2016/03/24/ddos-attacks/","excerpt":"","text":"Denial-of-service (DoS) and distributed denial-of-service (DDoS) attacks A denial-of-service attack overwhelms a system’s resources so that it cannot respond to service requests. A DDoS attack is also an attack on system’s resources, but it is launched from a large number of other host machines that are infected by malicious software controlled by the attacker. Unlike attacks that are designed to enable the attacker to gain or increase access, denial-of-service doesn’t provide direct benefits for attackers. For some of them, it’s enough to have the satisfaction of service denial. However, if the attacked resource belongs to a business competitor, then the benefit to the attacker may be real enough. Another purpose of a DoS attack can be to take a system offline so that a different kind of attack can be launched. One common example is session hijacking, which I’ll describe later. There are different types of DoS and DDoS attacks; the most common are TCP SYN flood attack, teardrop attack, smurf attack, ping-of-death attack and botnets. TCP SYN flood attack In this attack, an attacker exploits the use of the buffer space during a Transmission Control Protocol (TCP) session initialization handshake. The attacker’s device floods the target system’s small in-process queue with connection requests, but it does not respond when the target system replies to those requests. This causes the target system to time out while waiting for the response from the attacker’s device, which makes the system crash or become unusable when the connection queue fills up. There are a few countermeasures to a TCP SYN flood attack: Place servers behind a firewall configured to stop inbound SYN packets. Increase the size of the connection queue and decrease the timeout on open connections. Teardrop attack This attack causes the length and fragmentation offset fields in sequential Internet Protocol (IP) packets to overlap one another on the attacked host; the attacked system attempts to reconstruct packets during the process but fails. The target system then becomes confused and crashes. If users don’t have patches to protect against this DoS attack, disable SMBv2 and block ports 139 and 445. Smurf attack This attack involves using IP spoofing and the ICMP to saturate a target network with traffic. This attack method uses ICMP echo requests targeted at broadcast IP addresses. These ICMP requests originate from a spoofed “victim” address. For instance, if the intended victim address is 10.0.0.10, the attacker would spoof an ICMP echo request from 10.0.0.10 to the broadcast address 10.255.255.255. This request would go to all IPs in the range, with all the responses going back to 10.0.0.10, overwhelming the network. This process is repeatable, and can be automated to generate huge amounts of network congestion. To protect your devices from this attack, you need to disable IP-directed broadcasts at the routers. This will prevent the ICMP echo broadcast request at the network devices. Another option would be to configure the end systems to keep them from responding to ICMP packets from broadcast addresses. Ping of death attack This type of attack uses IP packets to ‘ping a target system with an IP size over the maximum of 65,535 bytes. IP packets of this size are not allowed, so attacker fragments the IP packet. Once the target system reassembles the packet, it can experience buffer overflows and other crashes. Ping of death attacks can be blocked by using a firewall that will check fragmented IP packets for maximum size. Botnets Botnets are the millions of systems infected with malware under hacker control in order to carry out DDoS attacks. These bots or zombie systems are used to carry out attacks against the target systems, often overwhelming the target system’s bandwidth and processing capabilities. These DDoS attacks are difficult to trace because botnets are located in differing geographic locations. Botnets can be mitigated by: RFC3704 filtering, which will deny traffic from spoofed addresses and help ensure that traffic is traceable to its correct source network. For example, RFC3704 filtering will drop packets from bogon list addresses. Black hole filtering, which drops undesirable traffic before it enters a protected network. When a DDoS attack is detected, the BGP (Border Gateway Protocol) host should send routing updates to ISP routers so that they route all traffic heading to victim servers to a null0 interface at the next hop. Resource: blog.netwrix.com","categories":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}],"tags":[],"keywords":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}]},{"title":"Dictionary attack","slug":"dictionary-attack","date":"2016-01-13T09:47:56.672Z","updated":"2016-01-13T09:47:00.000Z","comments":true,"path":"2016/01/13/dictionary-attack/","link":"","permalink":"http://yoursite.com/2016/01/13/dictionary-attack/","excerpt":"","text":"What is dictionary attack? Guessing ****password is one of they of ways to open a safe! So if you can guess many passwords and try them on the lock then you might be able to open the safe. All the password that we guess when we want to open a lock are saved somewhere in our memory which we first recall them and then apply them physically on the lock to try it. In computer science dictionary attack or brute force attack use the same algorithm but process the attack much faster than human. In these type of attacks there are usually a dictionary that consists of billions of passwords. These password are gathered by attackers and saved in a file to try them again on other authentications. So, the conclusion Always try to choose a unique password and use numbers, special chars, capital and lower letters to minimize the risk of guessing your passwords by others.","categories":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}],"tags":[],"keywords":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}]},{"title":"Hacking","slug":"hacking","date":"2015-12-29T18:23:04.356Z","updated":"2015-12-29T18:23:00.000Z","comments":true,"path":"2015/12/29/hacking/","link":"","permalink":"http://yoursite.com/2015/12/29/hacking/","excerpt":"","text":"Are you interested to learn ethical hacking or “white hat” hacking? There are lots of resources to help you get started and teach you how to think out of the box. The term “white hat” in Internet slang refers to an ethical computer hacker, or a computer security expert, who specializes in penetration testing and in other testing methodologies that ensures the security of an organization’s information systems. Website hacking is fun as long as you are learning it and https://www.hackthissite.org/ is a website that you can exercise and improve you skills. As a software developer, it is too important to find vulnerabilities. If you are a software developer, it is really vital that you care about the security of your software and how you can manage attacks to your applications or your website. We suggest that you learn more everyday and increase you hacking skills, because as long as you think like a hacker then you won’t write a vulnerable piece of software. Happy white hat hacking…","categories":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}],"tags":[],"keywords":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}]},{"title":"Camden Preserve Offers Opportunity for Developers","slug":"camden-preserve-offers-opportunity-for-developers","date":"2015-12-06T14:17:26.000Z","updated":"2022-12-25T15:15:21.658Z","comments":true,"path":"2015/12/06/camden-preserve-offers-opportunity-for-developers/","link":"","permalink":"http://yoursite.com/2015/12/06/camden-preserve-offers-opportunity-for-developers/","excerpt":"","text":"Camden Preserve Offers Opportunity for Developers (NewsUSA)As the population nationwide grows and uncharted areas are increasingly few and far between, those looking to purchase or develop land have fewer and fewer options. Is developing new, high-quality land an American dream of the past? Camden Preserve is one continuous 1,221-acre coastal community that is located in Camden County, Ga. The community overlooks the White Oak River, approximately a 20-minute boat ride to the Atlantic Ocean. Other local destinations, such as Sea Island and Jekyll Island, are within a short ride as well. Despite trends, this preserve seems poised to offer new opportunities to interested developers. The location is also just a 35-minute drive from the Jacksonville International Airport, which makes it easy to get anywhere in the world. Brunswick, St. Simons and Savanna, Ga., are all just a short drive away. Outdoor enthusiasts will find that the location is extremely appealing thanks to an abundunce of golfing, boating, fishing and hunting spots. And for those who just want to sit back, relax and enjoy the scenery, there are miles of gorgeous marshfront. Simply put, the location truly offers something for everyone to enjoy. As of now, Camden Preserve is undergoing phase one of development. The developing company is Egret Landing, LLC, which is managed by Zuckerman Homes, a Florida-based company specializing in residential communities. Additional land at Camden Preserve is already zoned, meaning that growth is imminent and opportunities will come and go quickly. In fact, the federal and state government recently selected the area as home to the new Interstate 95 interchange because of the predicted growth in the days ahead. As one of the last pristine approved properties available in southern Coastal Georgia, it is a rare and special place for those looking for new opportunities. The question is, how long will this opportunity last? Developers interested in learning more should contact Zuckerman Homes via email at info@zuckermanhomes.com or by phone at (954) 481-3700. Tweet","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"Packet sniffing","slug":"packet-sniffing","date":"2015-11-17T18:06:13.405Z","updated":"2015-11-17T18:06:00.000Z","comments":true,"path":"2015/11/17/packet-sniffing/","link":"","permalink":"http://yoursite.com/2015/11/17/packet-sniffing/","excerpt":"","text":"What is Packet Sniffing?When any data has to be transmitted over the computer network, it is broken down into smaller units at the sender’s node called data packets and reassembled at receiver’s node in original format. It is the smallest unit of communication over a computer network. It is also called a block, a segment, a datagram or a cell. The act of capturing data packet across the computer network is called packet sniffing. It is similar to as wire tapping to a telephone network. It is mostly used by crackers and hackers to collect information illegally about network. It is also used by ISPs, advertisers and governments. ISPs use packet sniffing to track all your activities such as: - who is receiver of your email - what is content of that email - what you download - sites you visit - what you looked on that website - downloads from a site - streaming events like video, audio, etc. Advertising agencies or internet advertising agencies are paid according to: - number of ads shown by them. - number of clicks on their ads also called PPC (pay per click). To achieve this target, these agencies use packet sniffing to inject advertisements into the flowing packets. Most of the time these ads contain malware. Government agencies use packet sniffing to: - ensure security of data over the network. - track an organisation’s none encrypted data. Packet Sniffer Packet sniffing is done by using tools called packet sniffer. It can be either filtered or unfiltered. Filtered is used when only specific data packets have to be captured and Unfiltered is used when all the packets have to be captured. WireShark, SmartSniff are examples of packet sniffing tools. How to prevent packet sniffing - Encrypting data you send or receive. - using trusted Wi-Fi networks. - Scanning your network for dangers or issues. What is Wireshark? Wireshark is a free and open-source packet analyzer. It is used for network troubleshooting, analysis, software and communications protocol development, and education. Originally named Ethereal, the project was renamed Wireshark in May 2006 due to trademark issues. Wireshark is cross-platform, using the Qt widget toolkit in current releases to implement its user interface, and using pcap to capture packets; it runs on Linux, macOS, BSD, Solaris, some other Unix-like operating systems, and Microsoft Windows. There is also a terminal-based (non-GUI) version called TShark. Wireshark, and the other programs distributed with it such as TShark, are free software, released under the terms of the GNU General Public License. In the late 1990s, Gerald Combs, a computer science graduate of the University of Missouri–Kansas City, was working for a small Internet service provider. The commercial protocol analysis products at the time were priced around $1500 and did not run on the company’s primary platforms (Solaris and Linux), so Gerald began writing Ethereal and released the first version around 1998. The Ethereal trademark is owned by Network Integration Services. In May 2006, Combs accepted a job with CACE Technologies. Combs still held copyright on most of Ethereal’s source code (and the rest was re-distributable under the GNU GPL), so he used the contents of the Ethereal Subversion repository as the basis for the Wireshark repository. However, he did not own the Ethereal trademark, so he changed the name to Wireshark. In 2010 Riverbed Technology purchased CACE and took over as the primary sponsor of Wireshark. Ethereal development has ceased, and an Ethereal security advisory recommended switching to Wireshark. Wireshark has won several industry awards over the years, including eWeek, InfoWorld, and PC Magazine. It is also the top-rated packet sniffer in the Insecure.Org network security tools survey and was the SourceForge Project of the Month in August 2010. Combs continues to maintain the overall code of Wireshark and issue releases of new versions of the software. The product website lists over 600 additional contributing authors. Wireshark application References: geeksforgeeks, Wikipedia","categories":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}],"tags":[],"keywords":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}]},{"title":"Representational state transfer","slug":"representational-state-transfer","date":"2015-09-30T16:54:27.547Z","updated":"2015-09-30T16:54:00.000Z","comments":true,"path":"2015/09/30/representational-state-transfer/","link":"","permalink":"http://yoursite.com/2015/09/30/representational-state-transfer/","excerpt":"","text":"What is representational state transfer or the REST API? Representational State Transfer (REST) is a software architectural style that defines a set of constraints to be used for creating Web services. Web services that conform to the REST architectural style, called RESTful Web services (RWS), provide interoperability between computer systems on the Internet. RESTful Web services allow the requesting systems to access and manipulate textual representations of Web resources by using a uniform and predefined set of stateless operations. Other kinds of Web services, such as SOAP Web services, expose their own arbitrary sets of operations. “Web resources” were first defined on the World Wide Web as documents or files identified by their URLs. However, today they have a much more generic and abstract definition that encompasses every thing or entity that can be identified, named, addressed, or handled, in any way whatsoever, on the Web. In a RESTful Web service, requests made to a resource’s URI will elicit a response with a payload formatted in HTML, XML, JSON, or some other format. The response can confirm that some alteration has been made to the stored resource, and the response can provide hypertext links to other related resources or collections of resources. When HTTP is used, as is most common, the operations (HTTP methods) available are GET, HEAD, POST, PUT, PATCH, DELETE, CONNECT, OPTIONS and TRACE. By using a stateless protocol and standard operations, RESTful systems aim for fast performance, reliability, and the ability to grow by reusing components that can be managed and updated without affecting the system as a whole, even while it is running. The term representational state transfer was introduced and defined in 2000 by Roy Fielding in his doctoral dissertation. Fielding’s dissertation explained the REST principles that were known as the “HTTP object model” beginning in 1994, and were used in designing the HTTP 1.1 and Uniform Resource Identifiers (URI) standards. The term is intended to evoke an image of how a well-designed Web application behaves: it is a network of Web resources (a virtual state-machine) where the user progresses through the application by selecting resource identifiers such as http://www.example.com/articles/21 and resource operations such as GET or POST (application state transitions), resulting in the next resource’s representation (the next application state) being transferred to the end user for their use. Reference: Wikipedia","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]},{"title":"Cloud Bots","slug":"cloud-bots","date":"2015-03-15T01:56:00.000Z","updated":"2015-03-15T01:56:00.000Z","comments":true,"path":"2015/03/15/cloud-bots/","link":"","permalink":"http://yoursite.com/2015/03/15/cloud-bots/","excerpt":"","text":"Cloud Bots Cloud bots term mean a set of computers that can do a certain task automatically.Intention of running cloud bots or Botnet can be malicious unless you do it for educational purposes or testing. Let’s say you want lots of computers to do certain tasks for you without owning them. In these kind of scenarios an attacker will intend to use other computers to do malicious tasks such as mining crypto currencies. A proper device for mining can be an ASIC hardware which come with high performance to mine crypto currencies and can be comparable to many CPU and&#x2F;or GPU that are running at the same time. A local computer can also do the same thing and a cloud computer is a virtual computer that is running publicly&#x2F;privately over the internet and can give services such as Bitcoin mining. So, a cloud bot or Botnet(Set of cloud bots) is a set of computers that running online and we can connect to them to use them for many purposes which an attacker can connect to lots of computers at the same time to use others CPU and GPU for malicious purpose such as mining crypto currencies.","categories":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}],"tags":[],"keywords":[{"name":"Security & Hacking","slug":"Security-Hacking","permalink":"http://yoursite.com/categories/Security-Hacking/"}]},{"title":"What is ISP","slug":"Internet-service-provider","date":"2014-11-10T04:50:27.547Z","updated":"2014-11-13T04:50:00.000Z","comments":true,"path":"2014/11/10/Internet-service-provider/","link":"","permalink":"http://yoursite.com/2014/11/10/Internet-service-provider/","excerpt":"","text":"What is ISP An internet service provider is an organization that provides internet to clients and customers. This can be also a satellite internet and there are possibilities to send and receive the data over a dish from the roof of our office or our home. The good thing here is the speed of downloading and uploading and the down side is the weather that can also affect the quality of our signals. Following video represent a brief description about this method.","categories":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}],"tags":[],"keywords":[{"name":"Learning","slug":"Learning","permalink":"http://yoursite.com/categories/Learning/"}]}]}